Script started on 2020-02-06 15:12:39-05:00 [TERM="xterm-256color" TTY="/dev/pts/2" COLUMNS="80" LINES="24"]
bash: /home/umrigar/cs240/bin/student.rc: Permission denied
bcohada1@g7-22:/import/linux/home1/bcohada1/i240a/submit/lab2$ cp =r[K[K-r _-[K[K-[K~/cs240/lab s/lab2/exercises/*
cp: missing destination file operand after '/home/bcohada1/cs240/labs/lab2/exercises/*'
Try 'cp --help' for more information.
bcohada1@g7-22:/import/linux/home1/bcohada1/i240a/submit/lab2$ cp -r ~/cs240/labs/lab2/exercises/*
cp: missing destination file operand after '/home/bcohada1/cs240/labs/lab2/exercises/*'
Try 'cp --help' for more information.
bcohada1@g7-22:/import/linux/home1/bcohada1/i240a/submit/lab2$ cd `[K~/projects
bcohada1@g7-22:~/projects$ ls
cs240  i240a
bcohada1@g7-22:~/projects$ git clone as[K[Kssh://user@remote.cs.binghamton.edu/~umrigar/git-repos/cs240.git
fatal: destination path 'cs240' already exists and is not an empty directory.
bcohada1@g7-22:~/projects$ cd ~
bcohada1@g7-22:~$ ln -s projects/cs240
ln: failed to create symbolic link './cs240': File exists
bcohada1@g7-22:~$ cd ~/git-repos/cs240
bash: cd: /home/bcohada1/git-repos/cs240: No such file or directory
bcohada1@g7-22:~$ cd `[K~/projects
bcohada1@g7-22:~/projects$ gity c[K[K[K clone ssh://bcohada1@remote.cs.binghamton.edu/~umrigar/git-repos/cs240.git
fatal: destination path 'cs240' already exists and is not an empty directory.
bcohada1@g7-22:~/projects$ cd
bcohada1@g7-22:~$ ls
cs240	 Documents  i240a	    Music     projects	Templates  Videos
Desktop  Downloads  logisimmm.circ  Pictures  Public	tmp
bcohada1@g7-22:~$ cd s[Kcs240\
> 
bcohada1@g7-22:~/cs240$ ls
announce.html  docs	      hws	  labs	    README.md
announce.umt   exams-quizzes  index.html  misc	    slides
assets	       exercises      index.umt   projects  umt.make
bcohada1@g7-22:~/cs240$ cd labs
bcohada1@g7-22:~/cs240/labs$ g't[K[Kit pull
/home/bcohada1/.bashrc: line 1: /home/umrigar/cs240/bin/student.rc: Permission denied
remote: Enumerating objects: 105, done.[K
remote: Counting objects:   0% (1/105)   [Kremote: Counting objects:   1% (2/105)   [Kremote: Counting objects:   2% (3/105)   [Kremote: Counting objects:   3% (4/105)   [Kremote: Counting objects:   4% (5/105)   [Kremote: Counting objects:   5% (6/105)   [Kremote: Counting objects:   6% (7/105)   [Kremote: Counting objects:   7% (8/105)   [Kremote: Counting objects:   8% (9/105)   [Kremote: Counting objects:   9% (10/105)   [Kremote: Counting objects:  10% (11/105)   [Kremote: Counting objects:  11% (12/105)   [Kremote: Counting objects:  12% (13/105)   [Kremote: Counting objects:  13% (14/105)   [Kremote: Counting objects:  14% (15/105)   [Kremote: Counting objects:  15% (16/105)   [Kremote: Counting objects:  16% (17/105)   [Kremote: Counting objects:  17% (18/105)   [Kremote: Counting objects:  18% (19/105)   [Kremote: Counting objects:  19% (20/105)   [Kremote: Counting objects:  20% (21/105)   [Kremote: Counting objects:  21% (23/105)   [Kremote: Counting objects:  22% (24/105)   [Kremote: Counting objects:  23% (25/105)   [Kremote: Counting objects:  24% (26/105)   [Kremote: Counting objects:  25% (27/105)   [Kremote: Counting objects:  26% (28/105)   [Kremote: Counting objects:  27% (29/105)   [Kremote: Counting objects:  28% (30/105)   [Kremote: Counting objects:  29% (31/105)   [Kremote: Counting objects:  30% (32/105)   [Kremote: Counting objects:  31% (33/105)   [Kremote: Counting objects:  32% (34/105)   [Kremote: Counting objects:  33% (35/105)   [Kremote: Counting objects:  34% (36/105)   [Kremote: Counting objects:  35% (37/105)   [Kremote: Counting objects:  36% (38/105)   [Kremote: Counting objects:  37% (39/105)   [Kremote: Counting objects:  38% (40/105)   [Kremote: Counting objects:  39% (41/105)   [Kremote: Counting objects:  40% (42/105)   [Kremote: Counting objects:  41% (44/105)   [Kremote: Counting objects:  42% (45/105)   [Kremote: Counting objects:  43% (46/105)   [Kremote: Counting objects:  44% (47/105)   [Kremote: Counting objects:  45% (48/105)   [Kremote: Counting objects:  46% (49/105)   [Kremote: Counting objects:  47% (50/105)   [Kremote: Counting objects:  48% (51/105)   [Kremote: Counting objects:  49% (52/105)   [Kremote: Counting objects:  50% (53/105)   [Kremote: Counting objects:  51% (54/105)   [Kremote: Counting objects:  52% (55/105)   [Kremote: Counting objects:  53% (56/105)   [Kremote: Counting objects:  54% (57/105)   [Kremote: Counting objects:  55% (58/105)   [Kremote: Counting objects:  56% (59/105)   [Kremote: Counting objects:  57% (60/105)   [Kremote: Counting objects:  58% (61/105)   [Kremote: Counting objects:  59% (62/105)   [Kremote: Counting objects:  60% (63/105)   [Kremote: Counting objects:  61% (65/105)   [Kremote: Counting objects:  62% (66/105)   [Kremote: Counting objects:  63% (67/105)   [Kremote: Counting objects:  64% (68/105)   [Kremote: Counting objects:  65% (69/105)   [Kremote: Counting objects:  66% (70/105)   [Kremote: Counting objects:  67% (71/105)   [Kremote: Counting objects:  68% (72/105)   [Kremote: Counting objects:  69% (73/105)   [Kremote: Counting objects:  70% (74/105)   [Kremote: Counting objects:  71% (75/105)   [Kremote: Counting objects:  72% (76/105)   [Kremote: Counting objects:  73% (77/105)   [Kremote: Counting objects:  74% (78/105)   [Kremote: Counting objects:  75% (79/105)   [Kremote: Counting objects:  76% (80/105)   [Kremote: Counting objects:  77% (81/105)   [Kremote: Counting objects:  78% (82/105)   [Kremote: Counting objects:  79% (83/105)   [Kremote: Counting objects:  80% (84/105)   [Kremote: Counting objects:  81% (86/105)   [Kremote: Counting objects:  82% (87/105)   [Kremote: Counting objects:  83% (88/105)   [Kremote: Counting objects:  84% (89/105)   [Kremote: Counting objects:  85% (90/105)   [Kremote: Counting objects:  86% (91/105)   [Kremote: Counting objects:  87% (92/105)   [Kremote: Counting objects:  88% (93/105)   [Kremote: Counting objects:  89% (94/105)   [Kremote: Counting objects:  90% (95/105)   [Kremote: Counting objects:  91% (96/105)   [Kremote: Counting objects:  92% (97/105)   [Kremote: Counting objects:  93% (98/105)   [Kremote: Counting objects:  94% (99/105)   [Kremote: Counting objects:  95% (100/105)   [Kremote: Counting objects:  96% (101/105)   [Kremote: Counting objects:  97% (102/105)   [Kremote: Counting objects:  98% (103/105)   [Kremote: Counting objects:  99% (104/105)   [Kremote: Counting objects: 100% (105/105)   [Kremote: Counting objects: 100% (105/105), done.[K
remote: Compressing objects:   1% (1/84)   [Kremote: Compressing objects:   2% (2/84)   [Kremote: Compressing objects:   3% (3/84)   [Kremote: Compressing objects:   4% (4/84)   [Kremote: Compressing objects:   5% (5/84)   [Kremote: Compressing objects:   7% (6/84)   [Kremote: Compressing objects:   8% (7/84)   [Kremote: Compressing objects:   9% (8/84)   [Kremote: Compressing objects:  10% (9/84)   [Kremote: Compressing objects:  11% (10/84)   [Kremote: Compressing objects:  13% (11/84)   [Kremote: Compressing objects:  14% (12/84)   [Kremote: Compressing objects:  15% (13/84)   [Kremote: Compressing objects:  16% (14/84)   [Kremote: Compressing objects:  17% (15/84)   [Kremote: Compressing objects:  19% (16/84)   [Kremote: Compressing objects:  20% (17/84)   [Kremote: Compressing objects:  21% (18/84)   [Kremote: Compressing objects:  22% (19/84)   [Kremote: Compressing objects:  23% (20/84)   [Kremote: Compressing objects:  25% (21/84)   [Kremote: Compressing objects:  26% (22/84)   [Kremote: Compressing objects:  27% (23/84)   [Kremote: Compressing objects:  28% (24/84)   [Kremote: Compressing objects:  29% (25/84)   [Kremote: Compressing objects:  30% (26/84)   [Kremote: Compressing objects:  32% (27/84)   [Kremote: Compressing objects:  33% (28/84)   [Kremote: Compressing objects:  34% (29/84)   [Kremote: Compressing objects:  35% (30/84)   [Kremote: Compressing objects:  36% (31/84)   [Kremote: Compressing objects:  38% (32/84)   [Kremote: Compressing objects:  39% (33/84)   [Kremote: Compressing objects:  40% (34/84)   [Kremote: Compressing objects:  41% (35/84)   [Kremote: Compressing objects:  42% (36/84)   [Kremote: Compressing objects:  44% (37/84)   [Kremote: Compressing objects:  45% (38/84)   [Kremote: Compressing objects:  46% (39/84)   [Kremote: Compressing objects:  47% (40/84)   [Kremote: Compressing objects:  48% (41/84)   [Kremote: Compressing objects:  50% (42/84)   [Kremote: Compressing objects:  51% (43/84)   [Kremote: Compressing objects:  52% (44/84)   [Kremote: Compressing objects:  53% (45/84)   [Kremote: Compressing objects:  54% (46/84)   [Kremote: Compressing objects:  55% (47/84)   [Kremote: Compressing objects:  57% (48/84)   [Kremote: Compressing objects:  58% (49/84)   [Kremote: Compressing objects:  59% (50/84)   [Kremote: Compressing objects:  60% (51/84)   [Kremote: Compressing objects:  61% (52/84)   [Kremote: Compressing objects:  63% (53/84)   [Kremote: Compressing objects:  64% (54/84)   [Kremote: Compressing objects:  65% (55/84)   [Kremote: Compressing objects:  66% (56/84)   [Kremote: Compressing objects:  67% (57/84)   [Kremote: Compressing objects:  69% (58/84)   [Kremote: Compressing objects:  70% (59/84)   [Kremote: Compressing objects:  71% (60/84)   [Kremote: Compressing objects:  72% (61/84)   [Kremote: Compressing objects:  73% (62/84)   [Kremote: Compressing objects:  75% (63/84)   [Kremote: Compressing objects:  76% (64/84)   [Kremote: Compressing objects:  77% (65/84)   [Kremote: Compressing objects:  78% (66/84)   [Kremote: Compressing objects:  79% (67/84)   [Kremote: Compressing objects:  80% (68/84)   [Kremote: Compressing objects:  82% (69/84)   [Kremote: Compressing objects:  83% (70/84)   [Kremote: Compressing objects:  84% (71/84)   [Kremote: Compressing objects:  85% (72/84)   [Kremote: Compressing objects:  86% (73/84)   [Kremote: Compressing objects:  88% (74/84)   [Kremote: Compressing objects:  89% (75/84)   [Kremote: Compressing objects:  90% (76/84)   [Kremote: Compressing objects:  91% (77/84)   [Kremote: Compressing objects:  92% (78/84)   [Kremote: Compressing objects:  94% (79/84)   [Kremote: Compressing objects:  95% (80/84)   [Kremote: Compressing objects:  96% (81/84)   [Kremote: Compressing objects:  97% (82/84)   [Kremote: Compressing objects:  98% (83/84)   [Kremote: Compressing objects: 100% (84/84)   [Kremote: Compressing objects: 100% (84/84), done.[K
Unpacking objects:   1% (1/90)   Unpacking objects:   2% (2/90)   Unpacking objects:   3% (3/90)   Unpacking objects:   4% (4/90)   Unpacking objects:   5% (5/90)   Unpacking objects:   6% (6/90)   Unpacking objects:   7% (7/90)   Unpacking objects:   8% (8/90)   Unpacking objects:  10% (9/90)   Unpacking objects:  11% (10/90)   Unpacking objects:  12% (11/90)   Unpacking objects:  13% (12/90)   Unpacking objects:  14% (13/90)   Unpacking objects:  15% (14/90)   Unpacking objects:  16% (15/90)   Unpacking objects:  17% (16/90)   Unpacking objects:  18% (17/90)   Unpacking objects:  20% (18/90)   Unpacking objects:  21% (19/90)   Unpacking objects:  22% (20/90)   Unpacking objects:  23% (21/90)   Unpacking objects:  24% (22/90)   Unpacking objects:  25% (23/90)   Unpacking objects:  26% (24/90)   Unpacking objects:  27% (25/90)   Unpacking objects:  28% (26/90)   Unpacking objects:  30% (27/90)   Unpacking objects:  31% (28/90)   Unpacking objects:  32% (29/90)   Unpacking objects:  33% (30/90)   Unpacking objects:  34% (31/90)   Unpacking objects:  35% (32/90)   Unpacking objects:  36% (33/90)   Unpacking objects:  37% (34/90)   Unpacking objects:  38% (35/90)   Unpacking objects:  40% (36/90)   Unpacking objects:  41% (37/90)   Unpacking objects:  42% (38/90)   Unpacking objects:  43% (39/90)   Unpacking objects:  44% (40/90)   Unpacking objects:  45% (41/90)   Unpacking objects:  46% (42/90)   Unpacking objects:  47% (43/90)   Unpacking objects:  48% (44/90)   Unpacking objects:  50% (45/90)   remote: Total 90 (delta 49), reused 0 (delta 0)[K
Unpacking objects:  51% (46/90)   Unpacking objects:  52% (47/90)   Unpacking objects:  53% (48/90)   Unpacking objects:  54% (49/90)   Unpacking objects:  55% (50/90)   Unpacking objects:  56% (51/90)   Unpacking objects:  57% (52/90)   Unpacking objects:  58% (53/90)   Unpacking objects:  60% (54/90)   Unpacking objects:  61% (55/90)   Unpacking objects:  62% (56/90)   Unpacking objects:  63% (57/90)   Unpacking objects:  64% (58/90)   Unpacking objects:  65% (59/90)   Unpacking objects:  66% (60/90)   Unpacking objects:  67% (61/90)   Unpacking objects:  68% (62/90)   Unpacking objects:  70% (63/90)   Unpacking objects:  71% (64/90)   Unpacking objects:  72% (65/90)   Unpacking objects:  73% (66/90)   Unpacking objects:  74% (67/90)   Unpacking objects:  75% (68/90)   Unpacking objects:  76% (69/90)   Unpacking objects:  77% (70/90)   Unpacking objects:  78% (71/90)   Unpacking objects:  80% (72/90)   Unpacking objects:  81% (73/90)   Unpacking objects:  82% (74/90)   Unpacking objects:  83% (75/90)   Unpacking objects:  84% (76/90)   Unpacking objects:  85% (77/90)   Unpacking objects:  86% (78/90)   Unpacking objects:  87% (79/90)   Unpacking objects:  88% (80/90)   Unpacking objects:  90% (81/90)   Unpacking objects:  91% (82/90)   Unpacking objects:  92% (83/90)   Unpacking objects:  93% (84/90)   Unpacking objects:  94% (85/90)   Unpacking objects:  95% (86/90)   Unpacking objects:  96% (87/90)   Unpacking objects:  97% (88/90)   Unpacking objects:  98% (89/90)   Unpacking objects: 100% (90/90)   Unpacking objects: 100% (90/90), done.
From ssh://remote.cs.binghamton.edu/~umrigar/git-repos/cs240
   0b7b862..5dd8253  master     -> origin/master
Updating 0b7b862..5dd8253
Fast-forward
 index.html                                  |  24 [32m+[m[31m-[m
 index.umt                                   |   6 [32m+[m
 labs/index.html                             |   4 [32m+[m[31m-[m
 labs/index.umt                              |   9 [32m+[m[31m-[m
 labs/lab2/exercises/.gitignore              |   1 [32m+[m
 labs/lab2/exercises/1-hello/.gitignore      |   1 [32m+[m
 labs/lab2/exercises/1-hello/Makefile        |   3 [32m+[m
 labs/lab2/exercises/1-hello/README          |   1 [32m+[m
 labs/lab2/exercises/1-hello/hello.cc        |  22 [32m++[m
 labs/lab2/exercises/2-hello/.gitignore      |   1 [32m+[m
 labs/lab2/exercises/2-hello/Makefile        |   3 [32m+[m
 labs/lab2/exercises/2-hello/README          |   4 [32m+[m
 labs/lab2/exercises/2-hello/hello.cc        |  48 [32m++++[m
 labs/lab2/exercises/3-overload/.gitignore   |   1 [32m+[m
 labs/lab2/exercises/3-overload/Makefile     |   3 [32m+[m
 labs/lab2/exercises/3-overload/overload.cc  |  16 [32m++[m
 labs/lab2/exercises/Makefile                |   2 [32m+[m
 labs/lab2/lab2.html                         | 257 [32m++++++++++++++++++++[m
 labs/lab2/lab2.pdf                          | Bin [31m0[m -> [32m93531[m bytes
 labs/lab2/lab2.umt                          | 358 [32m++++++++++++++++++++++++++++[m
 labs/lab2/lab2/hl-fine_blue.css             |  19 [32m++[m
 labs/lab2/lab2/hl-fine_blue.sty             |  19 [32m++[m
 labs/submission/submission/hl-fine_blue.css |   2 [32m+[m[31m-[m
 labs/submission/submission/hl-fine_blue.sty |   2 [32m+[m[31m-[m
 slides/c++-intro/c++-intro.html             | 228 [32m++++++++++++++[m[31m----[m
 slides/c++-intro/c++-intro.pdf              | Bin [31m167175[m -> [32m201292[m bytes
 slides/c++-intro/c++-intro.umt              | 148 [32m+++++++++++[m[31m-[m
 slides/c++-intro/c++-intro/hl-fine_blue.css |   2 [32m+[m[31m-[m
 slides/c++-intro/c++-intro/hl-fine_blue.sty |   2 [32m+[m[31m-[m
 slides/c++-intro/code/.gitignore            |   6 [32m+[m
 slides/c++-intro/code/Makefile              |  12 [32m+[m[31m-[m
 slides/c++-intro/code/alloc-dealloc.cc      |  26 [32m++[m
 slides/c++-intro/code/class-point.cc        |  33 [32m+++[m
 slides/c++-intro/code/struct-point.cc       |  31 [32m+++[m
 slides/c++-intro/code/sum-array.cc          |  14 [32m+[m[31m-[m
 slides/c++-intro/code/vec1.cc               |  40 [32m++++[m
 36 files changed, 1266 insertions(+), 82 deletions(-)
 create mode 100644 labs/lab2/exercises/.gitignore
 create mode 100644 labs/lab2/exercises/1-hello/.gitignore
 create mode 100644 labs/lab2/exercises/1-hello/Makefile
 create mode 100644 labs/lab2/exercises/1-hello/README
 create mode 100644 labs/lab2/exercises/1-hello/hello.cc
 create mode 100644 labs/lab2/exercises/2-hello/.gitignore
 create mode 100644 labs/lab2/exercises/2-hello/Makefile
 create mode 100644 labs/lab2/exercises/2-hello/README
 create mode 100644 labs/lab2/exercises/2-hello/hello.cc
 create mode 100644 labs/lab2/exercises/3-overload/.gitignore
 create mode 100644 labs/lab2/exercises/3-overload/Makefile
 create mode 100644 labs/lab2/exercises/3-overload/overload.cc
 create mode 100644 labs/lab2/exercises/Makefile
 create mode 100644 labs/lab2/lab2.html
 create mode 100644 labs/lab2/lab2.pdf
 create mode 100644 labs/lab2/lab2.umt
 create mode 100644 labs/lab2/lab2/hl-fine_blue.css
 create mode 100644 labs/lab2/lab2/hl-fine_blue.sty
 create mode 100644 slides/c++-intro/code/.gitignore
 create mode 100644 slides/c++-intro/code/alloc-dealloc.cc
 create mode 100644 slides/c++-intro/code/class-point.cc
 create mode 100644 slides/c++-intro/code/struct-point.cc
 create mode 100644 slides/c++-intro/code/vec1.cc
bcohada1@g7-22:~/cs240/labs$ ls
index.html  index.umt  lab0  lab1  lab2  submission
bcohada1@g7-22:~/cs240/labs$ ls
index.html  index.umt  lab0  lab1  lab2  submission
bcohada1@g7-22:~/cs240/labs$ cd ~/i249[K0a/submit/lab2
bcohada1@g7-22:~/i240a/submit/lab2$ c[ [K[Kp -r ~/cs240/labs/lab2/exervi[K[Kcises/* .
bcohada1@g7-22:~/i240a/submit/lab2$ ls
1-hello  2-hello  3-overload  lab2.LOG	Makefile
bcohada1@g7-22:~/i240a/submit/lab2$ cd 1-[K*
bcohada1@g7-22:~/i240a/submit/lab2/1-hello$ ls
hello.cc  Makefile  README
bcohada1@g7-22:~/i240a/submit/lab2/1-hello$ gcc[K[K[Kgcc ge[K[Khello.c -p[Ko hello
[01m[Kgcc:[m[K [01;31m[Kerror: [m[Khello.c: No such file or directory
[01m[Kgcc:[m[K [01;31m[Kfatal error: [m[Kno input files
compilation terminated.
bcohada1@g7-22:~/i240a/submit/lab2/1-hello$ gcc hello.c -o hello[C[C[C[C[C[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[Kgcc =[K-o hello.c
[01m[Kgcc:[m[K [01;31m[Kfatal error: [m[Kno input files
compilation terminated.
bcohada1@g7-22:~/i240a/submit/lab2/1-hello$ gcc -o hello.c hello
[01m[Kgcc:[m[K [01;31m[Kerror: [m[Khello: No such file or directory
[01m[Kgcc:[m[K [01;31m[Kfatal error: [m[Kno input files
compilation terminated.
bcohada1@g7-22:~/i240a/submit/lab2/1-hello$ gcc g[Khello.c
[01m[Kgcc:[m[K [01;31m[Kerror: [m[Khello.c: No such file or directory
[01m[Kgcc:[m[K [01;31m[Kfatal error: [m[Kno input files
compilation terminated.
bcohada1@g7-22:~/i240a/submit/lab2/1-hello$ make h[K[K
g++ -g -Wall -std=c++17    hello.cc   -o hello
bcohada1@g7-22:~/i240a/submit/lab2/1-hello$ ls
hello  hello.cc  Makefile  README
bcohada1@g7-22:~/i240a/submit/lab2/1-hello$ ./hello
usage: ./hello NAME...
bcohada1@g7-22:~/i240a/submit/lab2/1-hello$ ./hello bart lisa
hello bart
hello lisa
hello bcohada1@g7-22:~/i240a/submit/lab2/1-hello$ gbd hello
bash: gbd: command not found
bcohada1@g7-22:~/i240a/submit/lab2/1-hello$ g[Kgbd hello
bash: gbd: command not found
bcohada1@g7-22:~/i240a/submit/lab2/1-hello$ gbd hello[1P hello[1P hellod hellob hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) 
(gdb) l
1	#include <iostream>
2	#include <cstdlib>
3	
4	static void
5	sayHello(const char *name)
6	{
7	  std::cout << "hello " << name << std::endl;
8	}
9	
10	int 
(gdb) start bart lisa
Temporary breakpoint 1 at 0x11cd: file hello.cc, line 13.
Starting program: /import/linux/home1/bcohada1/projects/i240a/submit/lab2/1-hello/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe778) at hello.cc:13
13	  if (argc == 1) {
(gdb) 
(gdb) 1 13
Undefined command: "1".  Try "help".
(gdb) l 13
8	}
9	
10	int 
11	main(int argc, const char *argv[])
12	{
13	  if (argc == 1) {
14	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
15	    std::exit(1);
16	  }
17	  else {
(gdb) l
18	    for (int i = 1; i <= argc; i++) {
19	      sayHello(argv[i]);
20	    }
21	  }
22	}
(gdb) l[Kl
Line number 23 out of range; hello.cc has 22 lines.
(gdb) l 23
18	    for (int i = 1; i <= argc; i++) {
19	      sayHello(argv[i]);
20	    }
21	  }
22	}
(gdb) b say [KHello
Breakpoint 2 at 0x555555555181: file hello.cc, line 7.
(gdb) p argc
$1 = 3
(gdb) p argv
$2 = (const char **) 0x7fffffffe778
(gdb) p argv[]0][C
$3 = 0x7fffffffea64 "/import/linux/home1/bcohada1/projects/i240a/submit/lab2/1-hello/hello"
(gdb) p argv[0][1P]1]
$4 = 0x7fffffffeaaa "bart"
(gdb) p argv[1][1P]2]
$5 = 0x7fffffffeaaf "lisa"
(gdb) p argv[2][1P]3]
$6 = 0x0
(gdb) n
18	    for (int i = 1; i <= argc; i++) {
(gdb) n
19	      sayHello(argv[i]);
(gdb) nn
Undefined command: "nn".  Try "help".
(gdb) p *argv@3
$7 = {
  0x7fffffffea64 "/import/linux/home1/bcohada1/projects/i240a/submit/lab2/1-hello/hello", 0x7fffffffeaaa "bart", 0x7fffffffeaaf "lisa"}
(gdb) c
Continuing.

Breakpoint 2, sayHello (name=0x7fffffffeaaa "bart") at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) l
2	#include <cstdlib>
3	
4	static void
5	sayHello(const char *name)
6	{
7	  std::cout << "hello " << name << std::endl;
8	}
9	
10	int 
11	main(int argc, const char *argv[])
(gdb) backtrace
#0  sayHello (name=0x7fffffffeaaa "bart") at hello.cc:7
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffe778) at hello.cc:19
(gdb) up
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffe778) at hello.cc:19
19	      sayHello(argv[i]);
(gdb) p ar[K[Ki
$8 = 1
(gdb) p argc-[K
$9 = 3
(gdb) p argc[Kv
$10 = (const char **) 0x7fffffffe778
(gdb) n
hello bart
8	}
(gdb) n
main (argc=3, argv=0x7fffffffe778) at hello.cc:18
18	    for (int i = 1; i <= argc; i++) {
(gdb) p '[Ki
$11 = 1
(gdb) n
19	      sayHello(argv[i]);
(gdb) p i
$12 = 2
(gdb)  n[K[Kn

Breakpoint 2, sayHello (name=0x7fffffffeaaf "lisa") at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) p i
No symbol "i" in current context.
(gdb) c. say [KHello()
A syntax error in expression, near `. sayHello()'.
(gdb) c. sayHello()[1PsayHello()[C[C[C[C[C[C[C[C[1PsayHello()[C[C[C[C[C[C[C sayHello()[C[C[C[C[C[C[C[C
Too few arguments in function call.
(gdb) down
Bottom (innermost) frame selected; you cannot go down.
(gdb) up
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffe778) at hello.cc:19
19	      sayHello(argv[i]);
(gdb) down
#0  sayHello (name=0x7fffffffeaaf "lisa") at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) p name
$13 = 0x7fffffffeaaf "lisa"
(gdb) c Say[K[K[Ksayt[KHl[Kello()
Too few arguments in function call.
(gdb) p name
$14 = 0x7fffffffeaaf "lisa"
(gdb) c
Continuing.
hello lisa

Breakpoint 2, sayHello (name=0x0) at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) n
hello 8	}
(gdb) p '
Unmatched single quote.
(gdb) p i
No symbol "i" in current context.
(gdb) n
main (argc=3, argv=0x7fffffffe778) at hello.cc:18
18	    for (int i = 1; i <= argc; i++) {
(gdb) p i
$15 = 3
(gdb) c
Continuing.
[Inferior 1 (process 27063) exited normally]
(gdb) q
bcohada1@g7-22:~/i240a/submit/lab2/1-hello$ gedit hello[K[K[K[K[K[K[K[K[K[K[Kvim hello.cc
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"hello.cc" 22L, 363C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[35m#include [m[31m<iostream>[m
[35m#include [m[31m<cstdlib>[m

[32mstatic[m [32mvoid[m
sayHello([32mconst[m [32mchar[m *name)
{
  std::cout << [31m"hello "[m << name << std::endl;
}

[32mint[m
main([32mint[m argc, [32mconst[m [32mchar[m *argv[])
{
  [38;5;130mif[m (argc == [31m1[m) {
    std::cerr << [31m"usage: "[m << argv[[31m0[m] << [31m" NAME..."[m << std::endl;
    std::exit([31m1[m);
  }
  [38;5;130melse[m {
    [38;5;130mfor[m ([32mint[m i = [31m1[m; i <= argc; i++) {[19;7HsayHello(argv[i]);
    }
  }
}
[94m~                                                                               [m[24;63H1,1[11CAll]2;hello.cc (~/projects/i240a/submit/lab2/1-hello) - VIM]1;hello.cc[1;1H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;81m#include [m[95m<iostream>[m
[38;5;81m#include [m[95m<cstdlib>[m

[38;5;121mstatic[m [38;5;121mvoid[m
sayHello([38;5;121mconst[m [38;5;121mchar[m *name)
{
  std::cout << [95m"hello "[m << name << std::endl;
}

[38;5;121mint[m
main([38;5;121mint[m argc, [38;5;121mconst[m [38;5;121mchar[m *argv[])
{
  [93mif[m (argc == [95m1[m) {
    std::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;
    std::exit([95m1[m);
  }
  [93melse[m {
    [93mfor[m ([38;5;121mint[m i = [95m1[m; i <= argc; i++) {[19;7HsayHello(argv[i]);
    }
  }
}
[94m~                                                                               [m[24;63H1,1[11CAll"hello.cc" 22L, 363C[1;1H[?25h[?25l[24;53H~@k[1;1H[24;53H   [1;1H[24;1H[1m-- INSERT --[m[24;13H[K[24;63H1,1[11CAll[1;1H[?25h[?25l[24;64H8,22[18;22H[?25h[?25l[24;67H8[18;28H[?25h[?25l[24;66H31[18;31H[?25h[?25l[24;64H9,25[19;25H[?25h[?25l[24;64H8,27[18;27H[?25h[?25l[24;67H6[18;26H[?25h[?25l[24;67H5[18;25H[?25h[?25l argc; i++) {[18;37H[K[24;67H4]2;hello.cc + (~/projects/i240a/submit/lab2/1-hello) - VIM]1;hello.cc[18;24H[?25h[?25l[12;1H[46m{[22;1H}[m[24;63H22,2 [22;2H[?25h[?25l:[12;1H{[22;1H}[24;66H3[22;3H[?25h[?25l[22;2H[K[12;1H[46m{[22;1H}[m[24;66H2[22;2H[?25h[24;1H[K[22;1H[?25l[24;53H^[[22;1H[24;53H  [22;2H[24;63H22,1[10CAll[22;1H[?25h[?25l[24;53H:[22;1H[24;53H[K[24;1H:[?2004h[?25hx[?25l[?25h[?25l[?1006l[?1002l[?2004l"hello.cc" 22L, 362C written]2;Terminal - ]1;Terminal - [23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[?2004l[?1l>[?25h[?1049l[23;0;0tbcohada1@g7-22:~/i240a/submit/lab2/1-hello$ vim hello.cc[3Pgdb hellobd[C[C[C[C[C[C./hello bart lisa[Kls[K./hello bart lisa[8Pgbd hello./hello bart lisa[Kls[Kmake
g++ -g -Wall -std=c++17    hello.cc   -o hello
bcohada1@g7-22:~/i240a/submit/lab2/1-hello$ ./[K[Kmakevim hello.cc[3Pgdb hellobd[C[C[C[C[C[C./hello bart lisa[K
usage: ./hello NAME...
bcohada1@g7-22:~/i240a/submit/lab2/1-hello$ ./hello[3Pmakevim hello.cc[3Pgdb hellobd[C[C[C[C[C[C./hello bart lisa
hello bart
hello lisa
bcohada1@g7-22:~/i240a/submit/lab2/1-hello$ cd `[K~
bcohada1@g7-22:~$ cd [K[K[Kcd[K[Kcd ~./hello bart lisa[K[3Pmakevim hello.cc[3Pgdb hellobd[C[C[C[C[C[C./hello bart lisa[Kls[Kmakegcc hello.c-o hello.c hello[Khello.c -o hello[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cls[Kcd 1*[3Plscp -r ~/cs240/labs/lab2/exercises/* .[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[15Pd ~/i240a/submit/lab2
bcohada1@g7-22:~/i240a/submit/lab2$ ls
1-hello  2-hello  3-overload  lab2.LOG	Makefile
bcohada1@g7-22:~/i240a/submit/lab2$ cd 2*
bcohada1@g7-22:~/i240a/submit/lab2/2-hello$ ls
hello.cc  Makefile  README
bcohada1@g7-22:~/i240a/submit/lab2/2-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
bcohada1@g7-22:~/i240a/submit/lab2/2-hello$ ./hello
usage: ./hello NAME...
bcohada1@g7-22:~/i240a/submit/lab2/2-hello$ ./hello lisa bart
Hello Lisa
Hello Bart
Segmentation fault
bcohada1@g7-22:~/i240a/submit/lab2/2-hello$ ./hello lisa bart[K[K[K[K[K[K[K[K[K@[K'lisa simpson' b[K;[K'bart sipm[K[Kmpson '
Hello Lisa SimpsonhU
Hello Bart SimpsonhU
Segmentation fault
bcohada1@g7-22:~/i240a/submit/lab2/2-hello$ gdb [K[K[K[K./hello 'lisa simpson' 'bart simpson'[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Clisa bart[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K[3Pmake[2Plscd 2*[3Plscd ~/i240a/submit/lab2[K./hello bart lisa[K[3Pmakevim hello.cc[3Pgdb hellobd[C[C[C[C[C[Cdb[C[C[C[C[C[C
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) l
22	    inWord = std::isalpha(in[i]);
23	  }
24	}
25	
26	static void
27	sayHello(const char *name)
28	{
29	  std::cout << "Hello " << name << std::endl;
30	}
31	
(gdb) q
bcohada1@g7-22:~/i240a/submit/lab2/2-hello$ vim hello.cc
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"hello.cc" 48L, 1011C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[35m#include [m[31m<locale>[m
[35m#include [m[31m<iostream>[m
[35m#include [m[31m<cstdlib>[m
[35m#include [m[31m<cstring>[m

[34m/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */[m
[32mvoid[m
upcaseWords([32mconst[m [32mchar[m in[], [32mchar[m out[])
{
  [32mbool[m inWord = [31mfalse[m;
  [32mconst[m [32mint[m n = std::strlen(in);
  [38;5;130mfor[m ([32mint[m i = [31m0[m; i < n; i++) {
    [38;5;130mif[m (!inWord && std::isalpha(in[i])) {[17;7Hout[i] = std::toupper(in[i]);
    }
    [38;5;130melse[m {[20;7Hout[i] = in[i];
    }
    inWord = std::isalpha(in[i]);
  }[24;63H1,1[11CTop]2;hello.cc (~/projects/i240a/submit/lab2/2-hello) - VIM]1;hello.cc[1;1H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;81m#include [m[95m<locale>[m
[38;5;81m#include [m[95m<iostream>[m
[38;5;81m#include [m[95m<cstdlib>[m
[38;5;81m#include [m[95m<cstring>[m

[96m/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */[m
[38;5;121mvoid[m
upcaseWords([38;5;121mconst[m [38;5;121mchar[m in[], [38;5;121mchar[m out[])
{
  [38;5;121mbool[m inWord = [95mfalse[m;
  [38;5;121mconst[m [38;5;121mint[m n = std::strlen(in);
  [93mfor[m ([38;5;121mint[m i = [95m0[m; i < n; i++) {
    [93mif[m (!inWord && std::isalpha(in[i])) {[17;7Hout[i] = std::toupper(in[i]);
    }
    [93melse[m {[20;7Hout[i] = in[i];
    }
    inWord = std::isalpha(in[i]);
  }[24;63H1,1[11CTop"hello.cc" 48L, 1011C[1;1H[?25h[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;81m#include [m[95m<locale>[m
[38;5;81m#include [m[95m<iostream>[m
[38;5;81m#include [m[95m<cstdlib>[m
[38;5;81m#include [m[95m<cstring>[m

[96m/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */[m
[38;5;121mvoid[m
upcaseWords([38;5;121mconst[m [38;5;121mchar[m in[], [38;5;121mchar[m out[])
{
  [38;5;121mbool[m inWord = [95mfalse[m;
  [38;5;121mconst[m [38;5;121mint[m n = std::strlen(in);
  [93mfor[m ([38;5;121mint[m i = [95m0[m; i < n; i++) {
    [93mif[m (!inWord && std::isalpha(in[i])) {[17;7Hout[i] = std::toupper(in[i]);
    }
    [93melse[m {[20;7Hout[i] = in[i];
    }
    inWord = std::isalpha(in[i]);
  }
}

[38;5;121mstatic[m [38;5;121mvoid[m
sayHello([38;5;121mconst[m [38;5;121mchar[m *name)
{
  std::cout << [95m"Hello "[m << name << std::endl;
}


[38;5;121mint[m
main([38;5;121mint[m argc, [38;5;121mconst[m [38;5;121mchar[m *argv[])
{
  [93mif[m (argc == [95m1[m) {
    std::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;
    std::exit([95m1[m);
  }
  [93melse[m {
    [93mfor[m ([38;5;121mint[m i = [95m1[m; i <= argc; i++) {[42;7H[38;5;121mconst[m [38;5;121mchar[m *name = argv[i];[43;7H[38;5;121mchar[m friendlyName[strlen(name)];[44;7HupcaseWords(name, friendlyName);[45;7HsayHello(friendlyName);
    }
  }
}[49;173H1,1[11CAll[1;1H[?25h[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;81m#include [m[95m<locale>[m
[38;5;81m#include [m[95m<iostream>[m
[38;5;81m#include [m[95m<cstdlib>[m
[38;5;81m#include [m[95m<cstring>[m

[96m/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */[m
[38;5;121mvoid[m
upcaseWords([38;5;121mconst[m [38;5;121mchar[m in[], [38;5;121mchar[m out[])
{
  [38;5;121mbool[m inWord = [95mfalse[m;
  [38;5;121mconst[m [38;5;121mint[m n = std::strlen(in);
  [93mfor[m ([38;5;121mint[m i = [95m0[m; i < n; i++) {
    [93mif[m (!inWord && std::isalpha(in[i])) {[17;7Hout[i] = std::toupper(in[i]);
    }
    [93melse[m {[20;7Hout[i] = in[i];
    }
    inWord = std::isalpha(in[i]);
  }[24;63H1,1[11CTop[1;1H[?25h[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;81m#include [m[95m<locale>[m
[38;5;81m#include [m[95m<iostream>[m
[38;5;81m#include [m[95m<cstdlib>[m
[38;5;81m#include [m[95m<cstring>[m

[96m/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */[m
[38;5;121mvoid[m
upcaseWords([38;5;121mconst[m [38;5;121mchar[m in[], [38;5;121mchar[m out[])
{
  [38;5;121mbool[m inWord = [95mfalse[m;
  [38;5;121mconst[m [38;5;121mint[m n = std::strlen(in);
  [93mfor[m ([38;5;121mint[m i = [95m0[m; i < n; i++) {
    [93mif[m (!inWord && std::isalpha(in[i])) {[17;7Hout[i] = std::toupper(in[i]);
    }
    [93melse[m {[20;7Hout[i] = in[i];
    }
    inWord = std::isalpha(in[i]);
  }
}

[38;5;121mstatic[m [38;5;121mvoid[m
sayHello([38;5;121mconst[m [38;5;121mchar[m *name)
{
  std::cout << [95m"Hello "[m << name << std::endl;
}


[38;5;121mint[m
main([38;5;121mint[m argc, [38;5;121mconst[m [38;5;121mchar[m *argv[])
{
  [93mif[m (argc == [95m1[m) {
    std::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;
    std::exit([95m1[m);
  }
  [93melse[m {
    [93mfor[m ([38;5;121mint[m i = [95m1[m; i <= argc; i++) {[42;7H[38;5;121mconst[m [38;5;121mchar[m *name = argv[i];[43;7H[38;5;121mchar[m friendlyName[strlen(name)];[44;7HupcaseWords(name, friendlyName);[45;7HsayHello(friendlyName);
    }
  }
}[49;173H1,1[11CAll[1;1H[?25h[?25l[49;174H3,22[13;22H[?25h[?25l[49;173H37,43[37;43H[?25h[?25l[49;163H2[37;44H[95m[48;5;242m [m[49;1H[1m-- VISUAL --[m[49;163H[K[49;163H2[37;44H[49;173H37,44[9CAll[37;44H[?25h[?25l[49;163H3[37;45H[95m[48;5;242mN[m[49;177H5[37;45H[?25h[?25l[49;163H4[37;46H[95m[48;5;242mA[m[49;177H6[37;46H[?25h[?25l[49;163H5[37;47H[95m[48;5;242mM[m[49;177H7[37;47H[?25h[?25l[?25h[?25l[49;163H [38;17H[37;43H[95m NAM[m[49;1H[K[49;173H38,17[9CAll[38;17H[?25h[?25l[49;174H1,0-1[31;1H[?25h[?25l[49;163H\[31;1H[49;163H [31;1H[?25h[?25l[49;163H~@k[31;1H[49;163H   [31;1H[49;1H[1m-- INSERT --[m[49;173H[K[49;173H31,1[10CAll[31;1H[?25h[?25l\[49;176H2]2;hello.cc + (~/projects/i240a/submit/lab2/2-hello) - VIM]1;hello.cc[31;2H[?25h[?25l[95m0[m[49;176H3[31;3H[?25h[?25l NAME[49;176H8[31;8H[?25h[?25l[49;173H[K[49;173H31,8[10CAll[31;8H[?25h[?25l[49;173H[K[49;173H31,8[10CAll[31;8H[?25h[?25l[49;173H[K[49;173H31,8[10CAll[31;8H[?25h[?25l[49;173H[K[49;173H31,8[10CAll[31;8H[?25h[?25l[49;173H[K[49;173H31,8[10CAll[31;8H[?25h[?25l[49;173H[K[49;173H31,8[10CAll[31;8H[?25h[?25l[31;7H[K[49;176H7[31;7H[?25h[?25l[31;6H[K[49;176H6[31;6H[?25h[?25l[31;5H[K[49;176H5[31;5H[?25h[?25l[31;4H[K[49;176H4[31;4H[?25h[?25l[49;176H3[31;3H[?25h[?25l[31;2H[K[49;176H2[31;2H[?25h[?25l[31;1H[K[49;176H1[31;1H[?25h[?25ls[49;176H2[31;2H[?25h[?25li[49;176H3[31;3H[?25h[?25lp[49;176H4[31;4H[?25h[?25lm[49;176H5[31;5H[?25h[?25l[31;4H[K[49;176H4[31;4H[?25h[?25l[31;3H[K[49;176H3[31;3H[?25h[?25lm[49;176H4[31;4H[?25h[?25lp[49;176H5[31;5H[?25h[?25ls[49;176H6[31;6H[?25h[?25lo[49;176H7[31;7H[?25h[?25ln[49;176H8[31;8H[?25h[?25l\[49;176H9[31;9H[?25h[?25l[95m0[m[49;176H10[31;10H[?25h[?25l[31;9H[K[49;176H9 [31;9H[?25h[?25l[31;8H[K[49;176H8[31;8H[?25h[?25l[31;7H[K[49;176H7[31;7H[?25h[?25l[31;6H[K[49;176H6[31;6H[?25h[?25l[31;5H[K[49;176H5[31;5H[?25h[?25l[31;4H[K[49;176H4[31;4H[?25h[?25l[31;3H[K[49;176H3[31;3H[?25h[?25l[31;2H[K[49;176H2[31;2H[?25h[?25l[31;1H[K[49;176H1[31;1H[?25h[?25l[49;174H3[33;1H[?25h[?25l[49;4H[1m(insert)- VISUAL --[m[49;173H[K[49;163H2[34;1H[49;173H34,1[10CAll[34;1H[33;1H[38;5;121m[48;5;242mint[m[48;5;242m 
[?25h[?25l[mm[48;5;242mm[m[49;176H2[34;2H[?25h[?25l[49;163H3[35;2H[34;2H[48;5;242main([m[38;5;121m[48;5;242mint[m[48;5;242m argc, [m[38;5;121m[48;5;242mconst[m[48;5;242m [m[38;5;121m[48;5;242mchar[m[48;5;242m *argv[]) 
{[m[49;174H5[35;2H[?25h[?25l[?25h[?25l[49;163H4[36;3H[35;2H[48;5;242m 
  [m[49;174H6,3[36;3H[?25h[?25l[1C[93m[48;5;242mi[m[49;176H4[36;4H[?25h[?25l[1C[93m[48;5;242mf[m[49;176H5[36;5H[?25h[?25l[49;163H5[37;5H[36;5H[48;5;242m (argc == [m[95m[48;5;242m1[m[48;5;242m) { 
    [m[49;174H7[37;5H[?25h[?25ls[48;5;242ms[m[49;176H6[37;6H[?25h[?25l[49;163H6[38;7H[37;6H[48;5;242mtd::cerr << [m[95m[48;5;242m"usage: "[m[48;5;242m << argv[[m[95m[48;5;242m0[m[48;5;242m] << [m[95m[48;5;242m" NAME..."[m[48;5;242m << std::endl; 
    st[m[49;174H8,7[38;7H[?25h[?25ld[48;5;242md[m[49;176H8[38;8H[?25h[?25l[49;163H7[39;4H[38;8H[48;5;242m::exit([m[95m[48;5;242m1[m[48;5;242m); 
  }[m[49;174H9,4[39;4H[?25h[?25l[?25h[?25l[49;163H8[40;9H[39;4H[48;5;242m 
  [m[93m[48;5;242melse[m[48;5;242m {[m[49;173H40,9[40;9H[?25h[?25l[?25h[?25l[49;163H9[41;10H[40;9H[48;5;242m 
    [m[93m[48;5;242mfor[m[48;5;242m ([m[49;174H1,10[41;10H[?25h[?25l[1C[38;5;121m[48;5;242mi[m[49;177H1[41;11H[?25h[?25l[49;163H10[42;11H[41;11H[38;5;121m[48;5;242mnt[m[48;5;242m i = [m[95m[48;5;242m1[m[48;5;242m; i <= argc; i++) { 
      [m[38;5;121m[48;5;242mcons[m[49;174H2[42;11H[?25h[?25l[1C[38;5;121m[48;5;242mt[m[49;177H2[42;12H[?25h[?25l[49;164H1[43;12H[42;12H[48;5;242m [m[38;5;121m[48;5;242mchar[m[48;5;242m *name = argv[i]; 
      [m[38;5;121m[48;5;242mchar[m[48;5;242m [m[49;174H3[43;12H[?25h[?25lf[48;5;242mf[m[49;177H3[43;13H[?25h[?25l[49;164H2[44;13H[43;13H[48;5;242mriendlyName[strlen(name)]; 
      upcase[m[49;174H4[44;13H[?25h[?25lW[48;5;242mW[m[49;177H4[44;14H[?25h[?25l[49;164H3[45;14H[44;14H[48;5;242mords(name, friendlyName); 
      sayHell[m[49;174H5[45;14H[?25h[?25l[49;164H4[46;6H[45;14H[48;5;242mo(friendlyName); 
    }[m[49;174H6,6 [46;6H[?25h[?25l[?25h[?25l[?25h[?25l[49;163H  [48;2H[49;4H[1mINSERTt --[m[49;13H[K[49;173H48,2[10CAll[33;1H[38;5;121mint[m[33;4H[K[34;1Hmain([38;5;121mint[m argc, [38;5;121mconst[m [38;5;121mchar[m *argv[])[34;35H[K[35;1H{[35;2H[K[36;1H  [93mif[m (argc == [95m1[m) {[36;19H[K[37;1H    std::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;[37;66H[K[38;1H    std::exit([95m1[m);[38;18H[K[39;1H  }[39;4H[K[40;1H  [93melse[m {[40;9H[K[41;1H    [93mfor[m ([38;5;121mint[m i = [95m1[m; i <= argc; i++) {[41;38H[K[42;1H      [38;5;121mconst[m [38;5;121mchar[m *name = argv[i];[42;34H[K[43;1H      [38;5;121mchar[m friendlyName[strlen(name)];[43;39H[K[44;1H      upcaseWords(name, friendlyName);[44;39H[K[45;1H      sayHello(friendlyName);[45;30H[K[46;1H    }[35;1H[46m{[48;1H}[?25h[?25l[m[35;1H{[48;1H}[49;173H34,29[34;29H[?25h[?25l[49;4H[1m(insert)- VISUAL --[m[49;173H[K[49;163H2[34;30H[49;173H34,30[9CAll[34;29H[48;5;242mr[?25h[?25l[m[49;163H3[34;31H[48;5;242mg[m[49;177H1[34;31H[?25h[?25l[49;163H4[34;32H[48;5;242mv[m[46m[][m[49;177H2[34;32H[?25h[?25l[49;163H5[34;33H[48;5;242m[[m[49;177H3[34;33H[?25h[?25l[?25h[?25l[49;163H [35;2H[49;4H[1mINSERTt --[m[49;13H[K[49;173H35,2[10CAll[34;29Hrgv[46m[[m[]
[46m{[48;1H}[35;2H[?25h[?25l[m{[48;1H}[49;174H4,27[34;27H[?25h[?25l[49;4H[1m(insert)- VISUAL --[m[49;173H[K[49;163H2[34;28H[49;173H34,28[9CAll[34;27H[48;5;242m*[?25h[?25l[m[49;163H3[34;29H[48;5;242ma[m[49;177H9[34;29H[?25h[?25l[49;163H4[34;30H[48;5;242mr[m[49;176H30[34;30H[?25h[?25l[49;163H5[34;31H[48;5;242mg[m[49;177H1[34;31H[?25h[?25l[49;163H6[34;32H[48;5;242mv[m[46m[][m[49;177H2[34;32H[?25h[?25l[49;163H7[34;33H[48;5;242m[[m[49;177H3[34;33H[?25h[?25l[?25h[?25l[49;163H [35;2H[49;4H[1mINSERTt --[m[49;13H[K[49;173H35,2[10CAll[34;27H*argv[46m[[m[]
[46m{[48;1H}[35;2H[?25h[?25l[m{[48;1H}[49;174H4,16[34;16H[?25h[?25l[49;4H[1m(insert)- VISUAL --[m[49;173H[K[49;163H2[34;17H[49;173H34,17[9CAll[34;16H[38;5;121m[48;5;242mc[?25h[?25l[m[49;163H3[34;18H[38;5;121m[48;5;242mo[m[49;177H8[34;18H[?25h[?25l[49;163H4[34;19H[38;5;121m[48;5;242mn[m[49;177H9[34;19H[?25h[?25l[49;163H5[34;20H[38;5;121m[48;5;242ms[m[49;176H20[34;20H[?25h[?25l[49;163H6[34;21H[38;5;121m[48;5;242mt[m[49;177H1[34;21H[?25h[?25l[49;163H7[34;22H[48;5;242m [m[49;177H2[34;22H[?25h[?25l[49;163H8[34;23H[38;5;121m[48;5;242mc[m[49;177H3[34;23H[?25h[?25l[49;163H9[34;24H[38;5;121m[48;5;242mh[m[49;177H4[34;24H[?25h[?25l[49;163H10[34;25H[38;5;121m[48;5;242ma[m[49;177H5[34;25H[?25h[?25l[49;164H1[34;26H[38;5;121m[48;5;242mr[m[49;177H6[34;26H[?25h[?25l[49;164H2[34;27H[48;5;242m [m[49;177H7[34;27H[?25h[?25l[49;164H3[34;28H[48;5;242m*[m[49;177H8[34;28H[?25h[?25l[49;164H4[34;29H[48;5;242ma[m[49;177H9[34;29H[?25h[?25l[49;164H5[34;30H[48;5;242mr[m[49;176H30[34;30H[?25h[?25l[49;164H6[34;31H[48;5;242mg[m[49;177H1[34;31H[?25h[?25l[49;163H2 [35;2H[34;31H[48;5;242mv[]) 
{[m[49;174H5,2 [35;2H[?25h[?25l[?25h[?25l[?25h[?25l[49;163H19[34;34Hmain[46m([28C)[m[34;35H[K[35;1H{[49;174H4,34[34;34H[?25h[?25l[49;164H8[34;33Hmain([27C[46m][m)[49;177H3[34;33H[?25h[?25l[?25h[?25l[49;163H  [35;2H[49;4H[1mINSERTt --[m[49;13H[K[49;173H35,2[10CAll[34;16H[38;5;121mconst[m [38;5;121mchar[m *argv[46m[[m[]
[46m{[48;1H}[35;2H[?25h[?25l[m{[48;1H}[49;174H4,20[34;20H[?25h[?25l[49;4H[1m(insert)- VISUAL --[m[49;173H[K[49;163H2[34;21H[49;173H34,21[9CAll[34;20H[38;5;121m[48;5;242mt[?25h[?25l[m[49;163H3[34;22H[48;5;242m [m[49;177H2[34;22H[?25h[?25l[49;163H4[34;23H[38;5;121m[48;5;242mc[m[49;177H3[34;23H[?25h[?25l[?25h[?25l[49;163H [37;37H[49;4H[1mINSERTt --[m[49;13H[K[49;173H37,37[9CAll[34;20H[38;5;121mt[m [38;5;121mc[m[37;35H[46m[[1C][?25h[?25l[m[49;4H[1m(insert)- VISUAL --[m[49;173H[K[49;163H2[37;36H[49;173H37,36[9CAll[37;35H[[1C[48;5;242m][?25h[?25l[m[49;163H3[37;35H[46m[[m[95m[48;5;242m0[m[49;177H5[37;35H[?25h[?25l[49;163H4[37;34Hv[48;5;242m[[m[49;177H4[37;34H[?25h[?25l[49;163H5[37;33Hg[48;5;242mv[m[49;177H3[37;33H[?25h[?25l[49;163H6[37;32Hr[48;5;242mg[m[49;177H2[37;32H[?25h[?25l[49;163H7[37;31Ha[48;5;242mr[m[49;177H1[37;31H[?25h[?25l[?25h[?25l[49;163H [37;50H[49;4H[1mINSERTt --[m[49;13H[K[49;173H37,50[9CAll[37;32Hrgv[[95m0[m][12C[?25h[?25l[49;4H[1m(insert)- VISUAL --[m[49;173H[K[49;163H2[37;49H[49;173H37,49[9CAll[37;50H[95m[48;5;242m.[?25h[?25l[m[49;163H3[37;48H[1C[95m[48;5;242m.[m[49;177H8[37;48H[?25h[?25l[49;163H4[37;47H[1C[95m[48;5;242m.[m[49;177H7[37;47H[?25h[?25l[49;163H5[37;46H[1C[95m[48;5;242mE[m[49;177H6[37;46H[?25h[?25l[49;163H6[37;45H[1C[95m[48;5;242mM[m[49;177H5[37;45H[?25h[?25l[49;163H7[37;44H[1C[95m[48;5;242mA[m[49;177H4[37;44H[?25h[?25l[49;163H8[37;43H[1C[95m[48;5;242mN[m[49;177H3[37;43H[?25h[?25l[49;163H9[37;42H[1C[95m[48;5;242m [m[49;177H2[37;42H[?25h[?25l[49;163H10[37;41H [95m[48;5;242m"[m[49;177H1[37;41H[?25h[?25l[?25h[?25l[49;163H  [38;18H[49;4H[1mINSERTt --[m[49;13H[K[49;173H38,18[9CAll[37;42H[95m" NAME...[38;18H[?25h[?25l[m[49;174H7,34[37;34H[?25h[?25l[49;4H[1m(insert)- VISUAL --[m[49;173H[K[49;163H2[37;33H[49;173H37,33[9CAll[37;34H[48;5;242mv[?25h[?25l[m[49;163H3[37;32Hr[48;5;242mg[m[49;177H2[37;32H[?25h[?25l[49;163H4[37;31Ha[48;5;242mr[m[49;177H1[37;31H[?25h[?25l[49;163H5[37;30H [48;5;242ma[m[49;177H0[37;30H[?25h[?25l[?25h[?25l[49;163H [38;18H[49;4H[1mINSERTt --[m[49;13H[K[49;173H38,18[9CAll[37;31Hargv[38;18H[?25h[?25l[49;174H6,10[36;10H[?25h[?25l[49;4H[1m(insert)- VISUAL --[m[49;173H[K[49;163H2[36;11H[49;173H36,11[9CAll[36;10H[48;5;242mc[?25h[?25l[m[49;163H3[36;12H[48;5;242m [m[49;177H2[36;12H[?25h[?25l[49;163H4[36;13H[48;5;242m=[m[49;177H3[36;13H[?25h[?25l[49;163H5[36;14H[48;5;242m=[m[49;177H4[36;14H[?25h[?25l[49;163H6[36;15H[48;5;242m [m[49;177H5[36;15H[?25h[?25l[?25h[?25l[49;163H [36;15H[49;4H[1mINSERTt --[m[49;13H[K[49;173H36,15[9CAll[36;10Hc == [?25h[?25l[49;174H7,8 [37;8H[?25h[?25l[49;4H[1m(insert)- VISUAL --[m[49;173H[K[49;163H2[37;9H[49;173H37,9[10CAll[37;8H[48;5;242m:[?25h[?25l[m[49;163H3[37;10H[48;5;242m:[m[49;176H10[37;10H[?25h[?25l[49;163H4[37;11H[48;5;242mc[m[49;177H1[37;11H[?25h[?25l[49;163H5[37;12H[48;5;242me[m[49;177H2[37;12H[?25h[?25l[49;163H6[37;13H[48;5;242mr[m[49;177H3[37;13H[?25h[?25l[49;163H7[37;14H[48;5;242mr[m[49;177H4[37;14H[?25h[?25l[49;163H8[37;15H[48;5;242m [m[49;177H5[37;15H[?25h[?25l[49;163H9[37;16H[48;5;242m<[m[49;177H6[37;16H[?25h[?25l[49;163H10[37;17H[48;5;242m<[m[49;177H7[37;17H[?25h[?25l[49;164H1[37;18H[48;5;242m [m[49;177H8[37;18H[?25h[?25l[49;164H2[37;19H[95m[48;5;242m"[m[49;177H9[37;19H[?25h[?25l[49;164H3[37;20H[95m[48;5;242mu[m[49;176H20[37;20H[?25h[?25l[49;164H4[37;21H[95m[48;5;242ms[m[49;177H1[37;21H[?25h[?25l[49;164H5[37;22H[95m[48;5;242ma[m[49;177H2[37;22H[?25h[?25l[49;164H6[37;23H[95m[48;5;242mg[m[49;177H3[37;23H[?25h[?25l[49;164H7[37;24H[95m[48;5;242me[m[49;177H4[37;24H[?25h[?25l[49;163H2 [38;18H[37;24H[95m[48;5;242m: "[m[48;5;242m << argv[[m[95m[48;5;242m0[m[48;5;242m] << [m[95m[48;5;242m" NAME..."[m[48;5;242m << std::endl; 
    std::exit([m[95m[48;5;242m1[m[48;5;242m);[m[49;174H8,18[38;18H[?25h[?25l[?25h[?25l[?25h[?25l[?25h[?25l[?25h[?25l[?25h[?25l[?25h[?25l[?25h[?25l[?25h[?25l[?25h[?25l[49;164H7[37;34Hv[[95m0[m] << [95m" NAME..."[m << std::endl;[37;66H[K[38;1H    std::exit([95m1[m);[49;174H7,34[37;34H[?25h[?25l[49;164H8[37;35H[48;5;242mv[m[46m[[1C][m[49;177H5[37;35H[?25h[?25l[49;164H9[37;36H[48;5;242m[[m[1C][49;177H6[37;36H[?25h[?25l[49;163H30[37;37H[95m[48;5;242m0[m[46m][m[49;177H7[37;37H[?25h[?25l[?25h[?25l[49;163H  [39;4H[49;4H[1mINSERTt --[m[49;13H[K[49;173H39,4[10CAll[37;8H::cerr << [95m"usage: "[m << argv[46m[[m[95m0[m[36;18H[46m{[m[37;35H[[1C]

  [46m}[?25h[?25l[m[36;18H{[39;3H}[49;174H8,18[38;18H[?25h[?25l[49;4H[1m(insert)- VISUAL --[m[49;173H[K[49;163H1[38;18H[49;173H38,18[9CAll[38;18H[?25h[?25l[?25h[?25l[49;163H2[38;17H;[48;5;242m [m[49;177H7[38;17H[?25h[?25l[49;163H3[38;16H[46m([1C)[m[48;5;242m;[m[49;177H6[38;16H[?25h[?25l[49;163H4[38;15H([1C[48;5;242m)[m[49;177H5[38;15H[?25h[?25l[49;163H5[38;14H[46m([m[95m[48;5;242m1[m[49;177H4[38;14H[?25h[?25l[49;163H7[38;12Hi[48;5;242mt([m[49;177H2[38;12H[?25h[?25l[49;163H8[38;11Hx[48;5;242mi[m[49;177H1[38;11H[?25h[?25l[49;163H9[38;10He[48;5;242mx[m[49;177H0[38;10H[?25h[?25l[49;163H2[37;9H:[48;5;242mcerr << [m[95m[48;5;242m"usage: "[m[48;5;242m << argv[[m[95m[48;5;242m0[m[48;5;242m] << [m[95m[48;5;242m" NAME..."[m[48;5;242m << std::endl; 
    std::e[m[49;174H7,9 [37;9H[?25h[?25l:[48;5;242m:[m[49;176H8[37;8H[?25h[?25lt[48;5;242md:[m[49;176H6[37;6H[?25h[?25ls[48;5;242mt[m[49;176H5[37;5H[?25h[?25l [48;5;242ms[m[49;176H4[37;4H[?25h[?25l [48;5;242m [m[49;176H3[37;3H[?25h[?25l [48;5;242m [m[49;176H2[37;2H[?25h[?25l [48;5;242m [m[49;176H1[37;1H[?25h[?25l[49;163H3[36;1H [48;5;242m [m[93m[48;5;242mif[m[48;5;242m (argc == [m[95m[48;5;242m1[m[48;5;242m) { 
 [m[49;174H6[36;1H[?25h[?25l[?25h[?25l[49;163H [39;4H[49;4H[1mINSERTt --[m[49;13H[K[49;173H39,4[10CAll[36;2H [93mif[m (argc == [95m1[m) {[36;19H[K[37;1H    std::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;[37;66H[K[38;1H    std::exit([95m1[m);[38;18H[K[36;18H[46m{[39;3H}[?25h[?25l[m[36;18H{[39;3H}[49;174H8,18[38;18H[?25h[?25l[49;4H[1m(insert)- VISUAL --[m[49;173H[K[49;163H1[38;18H[49;173H38,18[9CAll[38;18H[?25h[?25l[?25h[?25l[?25h[?25l[49;163H2[38;17H;[48;5;242m [m[49;177H7[38;17H[?25h[?25l[49;163H3[38;16H[46m([1C)[m[48;5;242m;[m[49;177H6[38;16H[?25h[?25l[49;163H4[38;15H([1C[48;5;242m)[m[49;177H5[38;15H[?25h[?25l[49;163H5[38;14H[46m([m[95m[48;5;242m1[m[49;177H4[38;14H[?25h[?25l[49;163H6[38;13Ht[48;5;242m([m[49;177H3[38;13H[?25h[?25l[49;163H9[38;10He[48;5;242mxit[m[49;177H0[38;10H[?25h[?25l[49;163H10[38;9H:[48;5;242me[m[49;176H9 [38;9H[?25h[?25l[49;164H2[38;7Hd[48;5;242m::[m[49;176H7[38;7H[?25h[?25l[49;163H2 [37;6Ht[48;5;242md::cerr << [m[95m[48;5;242m"usage: "[m[48;5;242m << argv[[m[95m[48;5;242m0[m[48;5;242m] << [m[95m[48;5;242m" NAME..."[m[48;5;242m << std::endl; 
    std[m[49;174H7,6[37;6H[?25h[?25ls[48;5;242mt[m[49;176H5[37;5H[?25h[?25l [48;5;242ms[m[49;176H4[37;4H[?25h[?25l [48;5;242m  [m[49;176H2[37;2H[?25h[?25l [48;5;242m [m[49;176H1[37;1H[?25h[?25l[49;163H3[36;1H [48;5;242m [m[93m[48;5;242mif[m[48;5;242m (argc == [m[95m[48;5;242m1[m[48;5;242m) { 
 [m[49;174H6[36;1H[?25h[?25l[?25h[?25l[49;163H [39;4H[49;4H[1mINSERTt --[m[49;13H[K[49;173H39,4[10CAll[36;2H [93mif[m (argc == [95m1[m) {[36;19H[K[37;1H    std::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;[37;66H[K[38;1H    std::exit([95m1[m);[38;18H[K[36;18H[46m{[39;3H}[?25h[?25l[m[36;18H{[39;3H}[49;174H8,18[38;18H[?25h[?25l[49;176H7 [38;7H[?25h[?25l[49;4H[1m(insert)- VISUAL --[m[49;173H[K[49;163H2[38;6H[49;173H38,6[10CAll[38;7H[48;5;242md[?25h[?25l[m[49;163H3[38;5Hs[48;5;242mt[m[49;176H5[38;5H[?25h[?25l[49;163H4[38;4H [48;5;242ms[m[49;176H4[38;4H[?25h[?25l[49;163H2[37;4H [48;5;242mstd::cerr << [m[95m[48;5;242m"usage: "[m[48;5;242m << argv[[m[95m[48;5;242m0[m[48;5;242m] << [m[95m[48;5;242m" NAME..."[m[48;5;242m << std::endl; 
    [m[49;174H7[37;4H[?25h[?25l [48;5;242m [m[49;176H3[37;3H[?25h[?25l [48;5;242m [m[49;176H2[37;2H[?25h[?25l[49;163H3[36;2H [93m[48;5;242mif[m[48;5;242m (argc == [m[95m[48;5;242m1[m[48;5;242m) { 
  [m[49;174H6[36;2H[?25h[?25l [48;5;242m [m[49;176H1[36;1H[?25h[?25l[?25h[?25l[49;163H [37;2H[49;4H[1mINSERTt --[m[49;13H[K[49;173H37,2[10CAll[36;2H [93mif[m (argc == [95m1[m) {[36;19H[K[37;1H    std::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;[37;66H[K[38;1H    std[37;2H[?25h[?25l[36;18H[46m{[39;3H}[m[49;174H9,4[39;4H[?25h[?25l[49;4H[1m(insert)- VISUAL --[m[49;173H[K[49;163H2[39;3H[49;173H39,3[10CAll[39;4H[48;5;242m [?25h[?25l[38;3H[m[36;18H{[38;4H[48;5;242m std::exit([m[95m[48;5;242m1[m[48;5;242m); 
  }[m[49;174H8[38;3H[?25h[?25l [48;5;242m [m[49;176H2[38;2H[?25h[?25l[49;163H3[37;1H [48;5;242m   std::cerr << [m[95m[48;5;242m"usage: "[m[48;5;242m << argv[[m[95m[48;5;242m0[m[48;5;242m] << [m[95m[48;5;242m" NAME..."[m[48;5;242m << std::endl; 
  [m[49;174H7,1[37;1H[?25h[?25l[49;163H4[36;1H [48;5;242m [m[93m[48;5;242mif[m[48;5;242m (argc == [m[95m[48;5;242m1[m[48;5;242m) { 
 [m[49;174H6[36;1H[?25h[?25l[?25h[?25l[49;163H [40;5H[49;4H[1mINSERTt --[m[49;13H[K[49;173H40,5[10CAll[36;2H [93mif[m (argc == [95m1[m) {[36;19H[K[37;1H    std::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;[37;66H[K[38;1H    std::exit([95m1[m);[38;18H[K[39;1H  }[39;4H[K[40;5H[?25h[?25l[49;176H4[40;4H[?25h[?25l[41;9H[46m([25C)[m[49;174H1,9[41;9H[?25h[?25l[49;11H[1mVISUAL --[m[49;173H[K[49;163H1[41;9H[49;173H41,9[10CAll[41;9H[?25h[?25l[49;4H[1m(insert)I VISUAL- --[m[49;163H[K[49;163H4[41;12H[49;173H41,12[9CAll[41;9H[48;5;242m([m[38;5;121m[48;5;242min[m[23C)[41;12H[?25h[?25l[38;5;121mn[m[38;5;121m[48;5;242mt[m[49;178H-11[41;12H[?25h[?25l[38;5;121m[48;5;242mn[m[38;5;121mt[m[49;178H   [41;12H[?25h[?25l[49;163H5[41;13H[38;5;121m[48;5;242mt[m[49;177H3[41;13H[?25h[?25l[49;163H6[41;14H[48;5;242m [m[49;177H4[41;14H[?25h[?25l[49;163H7[41;15H[48;5;242mi[m[49;177H5[41;15H[?25h[?25l[49;163H8[41;16H[48;5;242m [m[49;177H6[41;16H[?25h[?25l[49;163H9[41;17H[48;5;242m=[m[49;177H7[41;17H[?25h[?25l[49;163H10[41;18H[48;5;242m [m[49;177H8[41;18H[?25h[?25l[49;164H1[41;19H[95m[48;5;242m1[m[49;177H9[41;19H[?25h[?25l[49;164H2[41;20H[48;5;242m;[m[49;176H20[41;20H[?25h[?25l[49;163H2 [42;22H[41;20H[48;5;242m i <= argc; i++) { 
      [m[38;5;121m[48;5;242mconst[m[48;5;242m [m[38;5;121m[48;5;242mchar[m[48;5;242m *nam[m[49;174H2,22[42;22H[?25h[?25lm[48;5;242me[m[49;178H-21[42;22H[?25h[?25l[48;5;242mm[me[49;178H   [42;22H[?25h[?25le[48;5;242me[m[49;177H3[42;23H[?25h[?25l [48;5;242m [m[49;177H4[42;24H[?25h[?25l[49;163H3[43;30H[42;24H[48;5;242m= argv[i]; 
      [m[38;5;121m[48;5;242mchar[m[48;5;242m friendlyName[strle[m[49;174H3,30[43;30H[?25h[?25l[?25h[?25l[49;163H [44;27H[49;4H[1mINSERTt --[m[49;13H[K[49;173H44,27[9CAll[41;9H([38;5;121mint[m i = [95m1[m; i <= argc; i++) {[41;38H[K[42;1H      [38;5;121mconst[m [38;5;121mchar[m *name = argv[i];[42;34H[K[43;1H      [38;5;121mchar[m friendlyName[strle[44;27H[?25h[?25l[49;174H2,7 [42;7H[?25h[?25l[49;4H[1m(insert)- VISUAL --[m[49;173H[K[49;163H2[42;8H[49;173H42,8[10CAll[42;7H[38;5;121m[48;5;242mc[?25h[?25l[m[49;163H3[42;9H[38;5;121m[48;5;242mo[m[49;176H9[42;9H[?25h[?25l[49;163H4[42;10H[38;5;121m[48;5;242mn[m[49;176H10[42;10H[?25h[?25l[49;163H5[42;11H[38;5;121m[48;5;242ms[m[49;177H1[42;11H[?25h[?25l[49;163H6[42;12H[38;5;121m[48;5;242mt[m[49;177H2[42;12H[?25h[?25l[49;163H7[42;13H[48;5;242m [m[49;177H3[42;13H[?25h[?25l[49;163H8[42;14H[38;5;121m[48;5;242mc[m[49;177H4[42;14H[?25h[?25l[49;163H9[42;15H[38;5;121m[48;5;242mh[m[49;177H5[42;15H[?25h[?25l[49;163H10[42;16H[38;5;121m[48;5;242ma[m[49;177H6[42;16H[?25h[?25l[49;164H1[42;17H[38;5;121m[48;5;242mr[m[49;177H7[42;17H[?25h[?25l[49;164H2[42;18H[48;5;242m [m[49;177H8[42;18H[?25h[?25l[?25h[?25l[49;163H  [43;23H[49;4H[1mINSERTt --[m[49;13H[K[49;173H43,23[9CAll[42;7H[38;5;121mconst[m [38;5;121mchar[m [43;23H[?25h[?25l[49;174H2,26[42;26H[?25h[?25l[49;4H[1m(insert)- VISUAL --[m[49;173H[K[49;163H2[42;27H[49;173H42,27[9CAll[42;26H[48;5;242ma[?25h[?25l[m[49;163H3[42;28H[48;5;242mr[m[49;177H8[42;28H[?25h[?25l[49;163H4[42;29H[48;5;242mg[m[49;177H9[42;29H[?25h[?25l[49;163H5[42;30H[48;5;242mv[m[46m[[mi[46m][m[49;176H30[42;30H[?25h[?25l[49;163H6[42;31H[48;5;242m[[mi][49;177H1[42;31H[?25h[?25l[49;163H7[42;32H[48;5;242mi[m[46m][m[49;177H2[42;32H[?25h[?25l[?25h[?25l[49;163H [42;32H[49;4H[1mINSERTt --[m[49;13H[K[49;173H42,32[9CAll[42;26Hargv[46m[[mi[?25h[?25l[i][49;177H4[42;34H[?25h[?25l[43;48r[43;1H[L[1;49r[49;173H[K[49;173H43,7[10CTop[43;7H[?25h[?25ln[49;176H8[43;8H[?25h[?25la[49;176H9[43;9H[?25h[?25lm[49;176H10[43;10H[?25h[?25le[49;177H1[43;11H[?25h[?25l+[49;177H2[43;12H[?25h[?25l\[49;177H3[43;13H[?25h[?25l[95m0[m[49;177H4[43;14H[?25h[?25l[49;4H[1m(insert)- VISUAL --[m[49;173H[K[49;163H2[43;13H[49;173H43,13[9CTop[43;14H[48;5;242m [?25h[?25l[m[49;163H3[43;12H\[95m[48;5;242m0[m[49;177H2[43;12H[?25h[?25l[49;163H4[43;11H+[48;5;242m\[m[49;177H1[43;11H[?25h[?25l[49;163H5[43;10He[48;5;242m+[m[49;177H0[43;10H[?25h[?25l[49;163H6[43;9Hm[48;5;242me[m[49;176H9 [43;9H[?25h[?25l[49;163H7[43;8Ha[48;5;242mm[m[49;176H8[43;8H[?25h[?25l[49;163H8[43;7Hn[48;5;242ma[m[49;176H7[43;7H[?25h[?25l[?25h[?25l[49;163H [43;12H[49;4H[1mINSERTt --[m[49;13H[K[49;173H44,12[9CBot[1;48r[48;1H
[1;49r[42;8Hame+\[95m0[m[42;14H[K[48;1H}[49;173H[K[49;173H44,12[9CBot[43;12H[?25h[?25l[49;174H3,14[42;14H[?25h[?25l[49;4H[1m(insert)- VISUAL --[m[49;173H[K[49;163H1[42;14H[49;173H43,14[9CBot[42;14H[?25h[?25l[?25h[?25l[49;163H2[42;13H[1C[48;5;242m [m[49;177H3[42;13H[?25h[?25l[49;163H3[42;12H\[95m[48;5;242m0[m[49;177H2[42;12H[?25h[?25l[49;163H4[42;11H+[48;5;242m\[m[49;177H1[42;11H[?25h[?25l[49;163H5[42;10He[48;5;242m+[m[49;177H0[42;10H[?25h[?25l[49;163H6[42;9Hm[48;5;242me[m[49;176H9 [42;9H[?25h[?25l[49;163H7[42;8Ha[48;5;242mm[m[49;176H8[42;8H[?25h[?25l[49;163H8[42;7Hn[48;5;242ma[m[49;176H7[42;7H[?25h[?25l[49;163H9[42;6H [48;5;242mn[m[49;176H6[42;6H[?25h[?25l[49;163H10[42;5H [48;5;242m [m[49;176H5[42;5H[?25h[?25l[49;164H1[42;4H [48;5;242m [m[49;176H4[42;4H[?25h[?25l[49;164H2[42;3H [48;5;242m [m[49;176H3[42;3H[?25h[?25l[49;164H3[42;2H [48;5;242m [m[49;176H2[42;2H[?25h[?25l[49;164H4[42;1H [48;5;242m [m[49;176H1[42;1H[?25h[?25l[?25h[?25l[49;163H~@k[42;1H[49;163H2  [41;34H
[48;5;242m [m[49;174H2,34[41;34H[?25h[?25l[49;163H~@k[41;34H[49;163H   [41;34H[49;4H[1mINSERTt --[m[49;13H[K[49;173H42,34[9CBot[41;48r[41;1H[2M[1;49r[41;8H[38;5;121monst[m [38;5;121mchar[m *name = argv[i];      [38;5;121mchar[m friendlyName[strlen(name)];[47;1H[94m~                                                                                                                                                                                             [48;1H~                                                                                                                                                                                             [m[49;173H[K[49;173H42,34[9CBot[41;34H[?25h[?25l[38;5;81m^Z[m      [38;5;121mchar[m friendlyName[strlen(name)];[49;177H5-36[41;36H[?25h[?25l      [38;5;121mchar[m friendlyName[strlen(name)];[41;72H[K[49;177H4   [41;34H[?25h[?25l      [38;5;121mchar[m friendlyName[strlen(name)];[41;71H[K[41;30H[46m[[mi[46m][m[49;177H3[41;33H[?25h[?25l;      [38;5;121mchar[m friendlyName[strlen(name)];[41;30H[i][49;177H4[41;34H[?25h[?25l[42;48r[42;1H[L[1;49r[41;40H[K[42;7H[38;5;121mchar[m friendlyName[strlen(name)];[49;173H[K[49;173H43,1[10CBot[42;1H[?25h[?25l[49;177H1[42;11H[?25h[?25l[49;176H7 [42;7H[?25h[?25l[38;5;121mchar[m friendlyName[strlen(name)];[42;38H[K[49;176H6[42;6H[?25h[?25l[38;5;121mchar[m friendlyName[strlen(name)];[42;37H[K[49;176H5[42;5H[?25h[?25l[38;5;121mchar[m friendlyName[strlen(name)];[42;36H[K[49;176H4[42;4H[?25h[?25l[38;5;121mchar[m friendlyName[strlen(name)];[42;35H[K[49;176H3[42;3H[?25h[?25l[38;5;121mchar[m friendlyName[strlen(name)];[42;34H[K[49;176H2[42;2H[?25h[?25l[38;5;121mchar[m friendlyName[strlen(name)];[42;33H[K[49;176H1[42;1H[?25h[?25l        [38;5;121mchar[m friendlyName[strlen(name)];[49;176H2-9[42;9H[?25h[?25l[38;5;121mchar[m friendlyName[strlen(name)];[42;33H[K[49;176H1  [42;1H[?25h[?25l [38;5;121mchar[m friendlyName[strlen(name)];[49;176H2[42;2H[?25h[?25l [38;5;121mchar[m friendlyName[strlen(name)];[49;176H3[42;3H[?25h[?25l [38;5;121mchar[m friendlyName[strlen(name)];[49;176H4[42;4H[?25h[?25l [38;5;121mchar[m friendlyName[strlen(name)];[49;176H5[42;5H[?25h[?25l [38;5;121mchar[m friendlyName[strlen(name)];[49;176H6[42;6H[?25h[?25l [38;5;121mchar[m friendlyName[strlen(name)];[49;176H7[42;7H[?25h[?25l[24C[46m([mname[46m)[m[49;176H31[42;31H[?25h[?25l(name)[49;174H5,30[44;30H[?25h[?25l[13;28H[46m([min[46m)[m[49;173H14,32[13;32H[?25h[?25l+;(in)[49;177H3[13;33H[?25h[?25l ;[49;177H4[13;34H[?25h[?25l;[13;34H[K[49;177H3[13;33H[?25h[?25l;[13;33H[K[13;28H[46m([min[46m)[m[49;177H2[13;32H[?25h[?25l ;(in)[49;177H3[13;33H[?25h[?25l+;[49;177H4[13;34H[?25h[?25l ;[49;177H5[13;35H[?25h[?25l[95m1[m;[49;177H6[13;36H[?25h[?25l[49;174H3,23[12;23H[?25h[?25l[49;173H41,25[40;25H[?25h[?25l argc; i++) {[40;37H[K[49;177H4[40;24H[?25h[?25l[34;1H[46m{[47;1H}[m[49;174H8,2 [47;2H[?25h[?25l[34;1H{[47;1H}[49;174H1,24[40;24H[?25h[?25l[49;174H2,25[41;25H[?25h[?25l[49;174H1,27[40;27H[?25h[?25l[49;4H[1m(insert)- VISUAL --[m[49;173H[K[49;163H2[40;26H[49;173H41,26[9CBot[40;27H[48;5;242mg[?25h[?25l[m[49;163H3[40;25Ha[48;5;242mr[m[49;177H5[40;25H[?25h[?25l[49;163H4[40;24H [48;5;242ma[m[49;177H4[40;24H[?25h[?25l[49;163H5[40;23H<[48;5;242m [m[49;177H3[40;23H[?25h[?25l[?25h[?25l[49;163H [40;24H[49;4H[1mINSERTt --[m[49;13H[K[49;173H41,24[9CBot[40;24H arg[?25h[?25l[49;11H[1mVISUAL --[m[49;173H[K[49;163H1[40;24H[49;173H41,24[9CBot[40;24H[?25h[?25l[49;4H[1m(insert)I VISUAL- --[m[49;163H[K[49;163H1[40;24H[49;173H41,24[9CBot[40;24H[?25h[?25l[49;163H [43;29H[49;4H[1mINSERTt --[m[49;13H[K[49;173H44,29[9CBot[43;29H[?25h[?25l[40;36H[46m{[45;5H}[m[49;174H1,37[40;37H[?25h[?25l{[45;5H}[49;177H8[40;38H[?25h[?25l/[49;177H9[40;39H[?25h[?25l[96m//[m[49;176H40[40;40H[?25h[?25l[96ms[m[49;177H1[40;41H[?25h[?25l[96ma[m[49;177H2[40;42H[?25h[?25l[96mm[m[49;177H3[40;43H[?25h[?25l[96me[m[49;177H4[40;44H[?25h[?25l[96m [m[49;177H5[40;45H[?25h[?25l[96mf[m[49;177H6[40;46H[?25h[?25l[96ma[m[49;177H7[40;47H[?25h[?25l[96mu[m[49;177H8[40;48H[?25h[?25l[96ml[m[49;177H9[40;49H[?25h[?25l[96mt[m[49;176H50[40;50H[?25h[?25l[96m [m[49;177H1[40;51H[?25h[?25l[96ma[m[49;177H2[40;52H[?25h[?25l[96ms[m[49;177H3[40;53H[?25h[?25l[96m [m[49;177H4[40;54H[?25h[?25l[96mt[m[49;177H5[40;55H[?25h[?25l[96mh[m[49;177H6[40;56H[?25h[?25l[96me[m[49;177H7[40;57H[?25h[?25l[96m [m[49;177H8[40;58H[?25h[?25l[96mp[m[49;177H9[40;59H[?25h[?25l[96mr[m[49;176H60[40;60H[?25h[?25l[96me[m[49;177H1[40;61H[?25h[?25l[96mv[m[49;177H2[40;62H[?25h[?25l[96mi[m[49;177H3[40;63H[?25h[?25l[96mo[m[49;177H4[40;64H[?25h[?25l[96my[m[49;177H5[40;65H[?25h[?25l[96mu[m[49;177H6[40;66H[?25h[?25l[40;65H[K[49;177H5[40;65H[?25h[?25l[40;64H[K[49;177H4[40;64H[?25h[?25l[96mu[m[49;177H5[40;65H[?25h[?25l[96ms[m[49;177H6[40;66H[?25h[?25l[49;173H14,37[13;37H[?25h[?25l[13;36H[K[49;177H6[13;36H[?25h[?25l[13;35H[K[49;177H5[13;35H[?25h[?25l[49;177H4[13;34H[?25h[?25l[13;33H[K[49;177H3[13;33H[?25h[?25l[46m([min[46m)[m[49;177H2[13;32H[?25h[?25l+(in)[49;177H3[13;33H[?25h[?25l[49;177H4[13;34H[?25h[?25l[95m1[m[49;177H5[13;35H[?25h[?25l[13;34H[K[49;177H4[13;34H[?25h[?25l[49;177H3[13;33H[?25h[?25l[13;32H[K[13;28H[46m([min[46m)[m[49;177H2[13;32H[?25h[?25l(in)[49;177H3[13;33H[?25h[?25l+[49;177H4[13;34H[?25h[?25l[49;177H5[13;35H[?25h[?25l[95m1[m[49;177H6[13;36H[?25h[?25l:[49;177H7[13;37H[?25h[?25l[13;36H[K[49;177H6[13;36H[?25h[?25l;[49;177H7[13;37H[?25h[?25l[42;24H[46m[[12C][m[49;173H43,38[42;38H[?25h[?25l[49;177H7[42;37H[?25h[?25l[46m [m]; [46m][m[49;177H8[42;38H[?25h[?25l[46m+[m];+[46m][m[49;177H9[42;39H[?25h[?25l[46m [m]; [46m][m[49;176H40[42;40H[?25h[?25l[95m[46m1[m];[95m1[m[46m][m[49;177H1[42;41H[?25h[?25l[34;1H[46m{[m[42;24H[[16C][47;1H[46m}[m[49;174H8,2 [47;2H[?25h[49;1H[K[47;1H[?25l[49;163H^[[47;1H[49;163H  [47;2H[49;173H48,1[10CBot[47;1H[?25h[?25l[49;163H:[47;1H[49;163H[K[49;1H:[?2004h[?25hx[?25l[?25h[?25l[?1006l[?1002l[?2004l"hello.cc" 48L, 1047C written]2;Terminal - ]1;Terminal - [23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[?2004l[?1l>[?25h[?1049l[23;0;0tbcohada1@g7-22:~/i240a/submit/lab2/2-hello$ vim hello.cc[3Pgdb hello./hello 'lisa simpson' 'bart simpson'lisa bart[K[K[3Pmake
g++ -g -Wall -std=c++17    hello.cc   -o hello
^[[Abcohada1@g7-22:~/i240a/submit/lab2/2-hello$ makevim hello.cc[3Pgdb hellovim hello.cc[8Pmake[Kmakevim hello.cc[3Pgdb hello./hello 'lisa simpson' 'bart simpson'lisa bart[K'lisa simpson' 'bart simpson'
Hello Lisa Simpson
Hello Bart Simpson
bcohada1@g7-22:~/i240a/submit/lab2/2-hello$ ./hello 'lisa simpson' 'bart simpson'make[Kvim hello.cc[3Pgdb hello./hello 'lisa simpson' 'bart simpson'lisa bart[K
Hello Lisa
Hello Bart
bcohada1@g7-22:~/i240a/submit/lab2/2-hello$ ./hello lisa bart'lisa simpson' 'bart simpson'lisa bart[K[Kvim ./hello lisa bart'lisa simpson' 'bart simpson'make[Kvim hello.cc
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;49r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[49;1H"hello.cc" 48L, 1047C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[35m#include [m[31m<locale>[m
[35m#include [m[31m<iostream>[m
[35m#include [m[31m<cstdlib>[m
[35m#include [m[31m<cstring>[m

[34m/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */[m
[32mvoid[m
upcaseWords([32mconst[m [32mchar[m in[], [32mchar[m out[])
{
  [32mbool[m inWord = [31mfalse[m;
  [32mconst[m [32mint[m n = std::strlen(in) + [31m1[m;
  [38;5;130mfor[m ([32mint[m i = [31m0[m; i < n; i++) {
    [38;5;130mif[m (!inWord && std::isalpha(in[i])) {[17;7Hout[i] = std::toupper(in[i]);
    }
    [38;5;130melse[m {[20;7Hout[i] = in[i];
    }
    inWord = std::isalpha(in[i]);
  }
}

[32mstatic[m [32mvoid[m
sayHello([32mconst[m [32mchar[m *name)
{
  std::cout << [31m"Hello "[m << name << std::endl;
}


[32mint[m
main([32mint[m argc, [32mconst[m [32mchar[m *argv[])
[106m{[m
  [38;5;130mif[m (argc == [31m1[m) {
    std::cerr << [31m"usage: "[m << argv[[31m0[m] << [31m" NAME..."[m << std::endl;
    std::exit([31m1[m);
  }
  [38;5;130melse[m {
    [38;5;130mfor[m ([32mint[m i = [31m1[m; i < argc; i++) { [34m//same fault as the previous[m[42;7H[32mconst[m [32mchar[m *name = argv[i];[43;7H[32mchar[m friendlyName[strlen(name) + [31m1[m];[44;7HupcaseWords(name, friendlyName);[45;7HsayHello(friendlyName);
    }
  }
[106m}[m[49;173H48,1[10CAll]2;hello.cc (~/projects/i240a/submit/lab2/2-hello) - VIM]1;hello.cc[48;1H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;81m#include [m[95m<locale>[m
[38;5;81m#include [m[95m<iostream>[m
[38;5;81m#include [m[95m<cstdlib>[m
[38;5;81m#include [m[95m<cstring>[m

[96m/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */[m
[38;5;121mvoid[m
upcaseWords([38;5;121mconst[m [38;5;121mchar[m in[], [38;5;121mchar[m out[])
{
  [38;5;121mbool[m inWord = [95mfalse[m;
  [38;5;121mconst[m [38;5;121mint[m n = std::strlen(in) + [95m1[m;
  [93mfor[m ([38;5;121mint[m i = [95m0[m; i < n; i++) {
    [93mif[m (!inWord && std::isalpha(in[i])) {[17;7Hout[i] = std::toupper(in[i]);
    }
    [93melse[m {[20;7Hout[i] = in[i];
    }
    inWord = std::isalpha(in[i]);
  }
}

[38;5;121mstatic[m [38;5;121mvoid[m
sayHello([38;5;121mconst[m [38;5;121mchar[m *name)
{
  std::cout << [95m"Hello "[m << name << std::endl;
}


[38;5;121mint[m
main([38;5;121mint[m argc, [38;5;121mconst[m [38;5;121mchar[m *argv[])
[46m{[m
  [93mif[m (argc == [95m1[m) {
    std::cerr << [95m"usage: "[m << argv[[95m0[m] << [95m" NAME..."[m << std::endl;
    std::exit([95m1[m);
  }
  [93melse[m {
    [93mfor[m ([38;5;121mint[m i = [95m1[m; i < argc; i++) { [96m//same fault as the previous[m[42;7H[38;5;121mconst[m [38;5;121mchar[m *name = argv[i];[43;7H[38;5;121mchar[m friendlyName[strlen(name) + [95m1[m];[44;7HupcaseWords(name, friendlyName);[45;7HsayHello(friendlyName);
    }
  }
[46m}[m[49;173H48,1[10CAll"hello.cc" 48L, 1047C[48;1H[?25h[?25l[35;1H{[48;1H}[49;173H14,36[14;36H[?25h[?25l[49;163H<20>[14;36H[49;163H    [15;1H[49;174H5,1 [15;1H[?25h[?25l[49;163H~@k[15;1H[49;163H   [14;36H[49;174H4,36[14;36H[?25h[?25l[49;163H~@k[14;36H[49;163H   [14;36H[49;1H[1m-- INSERT --[m[49;13H[K[49;173H14,36[9CAll[14;36H[?25h[?25l ;[49;177H7]2;hello.cc + (~/projects/i240a/submit/lab2/2-hello) - VIM]1;hello.cc[14;37H[?25h[?25l;[14;37H[K[49;177H6[14;36H[?25h[?25l[49;177H7[14;37H[?25h[?25l[49;177H8[14;38H[?25h[?25l/[49;177H9[14;39H[?25h[?25l[96m//[m[49;176H40[14;40H[?25h[?25l[96mi[m[49;177H1[14;41H[?25h[?25l[96mn[m[49;177H2[14;42H[?25h[?25l[96m [m[49;177H3[14;43H[?25h[?25l[96mo[m[49;177H4[14;44H[?25h[?25l[96mr[m[49;177H5[14;45H[?25h[?25l[96md[m[49;177H6[14;46H[?25h[?25l[96me[m[49;177H7[14;47H[?25h[?25l[96mr[m[49;177H8[14;48H[?25h[?25l[96m [m[49;177H9[14;49H[?25h[?25l[96mt[m[49;176H50[14;50H[?25h[?25l[96mo[m[49;177H1[14;51H[?25h[?25l[96m [m[49;177H2[14;52H[?25h[?25l[96ms[m[49;177H3[14;53H[?25h[?25l[96me[m[49;177H4[14;54H[?25h[?25l[96me[m[49;177H5[14;55H[?25h[?25l[96m [m[49;177H6[14;56H[?25h[?25l[96m'[m[49;177H7[14;57H[?25h[?25l[14;56H[K[49;177H6[14;56H[?25h[?25l[96m'[m[49;177H7[14;57H[?25h[?25l[96m|[m[49;177H8[14;58H[?25h[?25l[95m0[m[49;177H9[14;59H[?25h[?25l[14;58H[K[49;177H8[14;58H[?25h[?25l[14;57H[K[49;177H7[14;57H[?25h[?25l[96m\
  for (int i = [1C; i < n; i++) {[m[49;177H8[14;58H[?25h[?25l[95m0[m
  [93mfor[m ([38;5;121mint[m i = [1C; i < n; i++) {[49;177H9[14;59H[?25h[?25l[38;5;81m0[m[95m2[m[49;176H60[14;60H[?25h[?25l[95m0[m[14;59H[K[49;176H59[14;59H[?25h[?25l[96m@[m[49;176H60[14;60H[?25h[?25l[14;59H[K[49;176H59[14;59H[?25h[?25l[96m'[m[49;176H60[14;60H[?25h[?25l[96m [m[49;177H1[14;61H[?25h[?25l[49;176H55[14;55H[?25h[?25l[1C[96m '\[m[95m0[m[96m' [m[49;177H6[14;56H[?25h[?25l[96mt '\[m[95m0[m[96m' [m[49;177H7[14;57H[?25h[?25l[96me '\[m[95m0[m[96m' [m[49;177H8[14;58H[?25h[?25l[96mr '\[m[95m0[m[96m' [m[49;177H9[14;59H[?25h[?25l[96mm '\[m[95m0[m[96m' [m[49;176H60[14;60H[?25h[?25l[96mi '\[m[95m0[m[96m' [m[49;177H1[14;61H[?25h[?25l[96mn '\[m[95m0[m[96m' [m[49;177H2[14;62H[?25h[?25l[96ma '\[m[95m0[m[96m' [m[49;177H3[14;63H[?25h[?25l[96mt '\[m[95m0[m[96m' [m[49;177H4[14;64H[?25h[?25l[96mo '\[m[95m0[m[96m' [m[49;177H5[14;65H[?25h[?25l[96mr '\[m[95m0[m[96m' [m[49;177H6[14;66H[?25h[?25l[49;176H72[14;72H[?25h[?25l[49;176H40[14;40H[?25h[?25l[96m\in order to see terminator '\[m[95m0[m[96m' [m[49;177H1[14;41H[?25h[?25l[96m0in order to see terminator '\[m[95m0[m[96m' [m[49;177H2[14;42H[?25h[?25l[49;177H1[14;41H[?25h[?25l[49;177H0[14;40H[?25h[?25l[96m'\0in order to see terminator '\[m[95m0[m[96m' [m[49;177H1[14;41H[?25h[?25l[49;177H2[14;42H[?25h[?25l[49;177H3[14;43H[?25h[?25l[95m0[m[96m'in order to see terminator '\[m[95m0[m[96m' [m[49;177H4[14;44H[?25h[?25l[96m in order to see terminator '\[m[95m0[m[96m' [m[49;177H5[14;45H[?25h[?25l[1C[96min order to see terminator '\[m[95m0[m[96m' [m[49;177H6[14;46H[?25h[?25l[96msin order to see terminator '\[m[95m0[m[96m' [m[49;177H7[14;47H[?25h[?25l[49;177H6[14;46H[?25h[?25l[49;177H5[14;45H[?25h[?25l[49;177H4[14;44H[?25h[?25l[49;177H3[14;43H[?25h[?25l[49;177H2[14;42H[?25h[?25l[49;177H1[14;41H[?25h[?25l[49;177H0[14;40H[?25h[?25l[96m '\[m[95m0[m[96m' isin order to see terminator '\[m[95m0[m[96m' [m[49;177H1[14;41H[?25h[?25l[49;177H2[14;42H[?25h[?25l[49;177H3[14;43H[?25h[?25l[49;177H4[14;44H[?25h[?25l[49;177H5[14;45H[?25h[?25l[49;177H6[14;46H[?25h[?25l[49;177H7[14;47H[?25h[?25l[49;177H8[14;48H[?25h[?25l[96m in order to see terminator '\[m[95m0[m[96m' [m[49;177H9[14;49H[?25h[?25l[96main order to see terminator '\[m[95m0[m[96m' [m[49;176H50[14;50H[?25h[?25l[96mtin order to see terminator '\[m[95m0[m[96m' [m[49;177H1[14;51H[?25h[?25l[96m in order to see terminator '\[m[95m0[m[96m' [m[49;177H2[14;52H[?25h[?25l[96mtin order to see terminator '\[m[95m0[m[96m' [m[49;177H3[14;53H[?25h[?25l[96mhin order to see terminator '\[m[95m0[m[96m' [m[49;177H4[14;54H[?25h[?25l[96mein order to see terminator '\[m[95m0[m[96m' [m[49;177H5[14;55H[?25h[?25l[96m in order to see terminator '\[m[95m0[m[96m' [m[49;177H6[14;56H[?25h[?25l[96mein order to see terminator '\[m[95m0[m[96m' [m[49;177H7[14;57H[?25h[?25l[96mnin order to see terminator '\[m[95m0[m[96m' [m[49;177H8[14;58H[?25h[?25l[96mdin order to see terminator '\[m[95m0[m[96m' [m[49;177H9[14;59H[?25h[?25l[96m in order to see terminator '\[m[95m0[m[96m' [m[49;176H60[14;60H[?25h[?25l[96moin order to see terminator '\[m[95m0[m[96m' [m[49;177H1[14;61H[?25h[?25l[96mfin order to see terminator '\[m[95m0[m[96m' [m[49;177H2[14;62H[?25h[?25l[96m in order to see terminator '\[m[95m0[m[96m' [m[49;177H3[14;63H[?25h[?25l[96mtin order to see terminator '\[m[95m0[m[96m' [m[49;177H4[14;64H[?25h[?25l[96mhin order to see terminator '\[m[95m0[m[96m' [m[49;177H5[14;65H[?25h[?25l[96mein order to see terminator '\[m[95m0[m[96m' [m[49;177H6[14;66H[?25h[?25l[96m in order to see terminator '\[m[95m0[m[96m' [m[49;177H7[14;67H[?25h[?25l[96msin order to see terminator '\[m[95m0[m[96m' [m[49;177H8[14;68H[?25h[?25l[96mtin order to see terminator '\[m[95m0[m[96m' [m[49;177H9[14;69H[?25h[?25l[96mrin order to see terminator '\[m[95m0[m[96m' [m[49;176H70[14;70H[?25h[?25l[1C[96min order to see terminator '\[m[95m0[m[96m' [m[49;177H1[14;71H[?25h[?25l[96mnin order to see terminator '\[m[95m0[m[96m' [m[49;177H2[14;72H[?25h[?25l[96mgin order to see terminator '\[m[95m0[m[96m' [m[49;177H3[14;73H[?25h[?25l[96m in order to see terminator '\[m[95m0[m[96m' [m[49;177H4[14;74H[?25h[?25l[96min order to see terminator '\[m[95m0[m[96m' [m[14;105H[K[49;177H3[14;73H[?25h[?25l[96m\in order to see terminator '\[m[95m0[m[96m' [m[49;177H4[14;74H[?25h[?25l[96min order to see terminator '\[m[95m0[m[96m' [m[14;105H[K[49;177H3[14;73H[?25h[?25l[96m'in order to see terminator '\[m[95m0[m[96m' [m[49;177H4[14;74H[?25h[?25l[96m in order to see terminator '\[m[95m0[m[96m' [m[49;177H5[14;75H[?25h[?25l[96min order to see terminator '\[m[95m0[m[96m' [m[14;106H[K[49;177H4[14;74H[?25h[?25l[96min order to see terminator '\[m[95m0[m[96m' [m[14;105H[K[49;177H3[14;73H[?25h[?25l[96m,in order to see terminator '\[m[95m0[m[96m' [m[49;177H4[14;74H[?25h[?25l[96m in order to see terminator '\[m[95m0[m[96m' [m[49;177H5[14;75H[?25h[?25l[96msin order to see terminator '\[m[95m0[m[96m' [m[49;177H6[14;76H[?25h[?25l[96moin order to see terminator '\[m[95m0[m[96m' [m[49;177H7[14;77H[?25h[?25l[96m in order to see terminator '\[m[95m0[m[96m' [m[49;177H8[14;78H[?25h[?25l[96min order to see terminator '\[m[95m0[m[96m' [m[14;109H[K[49;177H7[14;77H[?25h[?25l[96min order to see terminator '\[m[95m0[m[96m' [m[14;108H[K[49;177H6[14;76H[?25h[?25l[96min order to see terminator '\[m[95m0[m[96m' [m[14;107H[K[49;177H5[14;75H[?25h[?25l[96min order to see terminator '\[m[95m0[m[96m' [m[14;106H[K[49;177H4[14;74H[?25h[?25l[96m in order to see terminator '\[m[95m0[m[96m' [m[49;177H5[14;75H[?25h[?25l[49;176H107[14;107H[?25h[?25l[96mw[m[49;178H8[14;108H[?25h[?25l[96me[m[49;178H9[14;109H[?25h[?25l[96m [m[49;177H10[14;110H[?25h[?25l[96mn[m[49;178H1[14;111H[?25h[?25l[96me[m[49;178H2[14;112H[?25h[?25l[96me[m[49;178H3[14;113H[?25h[?25l[96md[m[49;178H4[14;114H[?25h[?25l[96m [m[49;178H5[14;115H[?25h[?25l[96m'[m[49;178H6[14;116H[?25h[?25l[96m'[m[49;178H7[14;117H[?25h[?25l[49;178H6[14;116H[?25h[?25l[95m'+'[m[49;178H7[14;117H[?25h[?25l[96m'+[m[95m1[m[96m'[m[49;178H8[14;118H[?25h[?25l[49;178H9[14;119H[?25h[?25l[49;173H41,24 [41;24H[?25h[?25l[35;1H[46m{[48;1H}[m[49;173H35,2 [35;2H[?25h[?25l{[48;1H}[49;173H13,23[13;23H[?25h[?25l[15;31H[46m{[23;3H}[m[49;174H5,32[15;32H[?25h[?25l{[23;3H}[49;174H4,23[14;23H[?25h[?25l[49;4H[1m(insert)- VISUAL --[m[49;173H[K[49;163H2[14;24H[49;173H14,24[9CAll[14;24H[48;5;242mt[?25h[?25l[m[49;163H3[14;25H[48;5;242mr[m[49;177H5[14;25H[?25h[?25l[49;163H4[14;26H[48;5;242ml[m[49;177H6[14;26H[?25h[?25l[49;163H5[14;27H[48;5;242me[m[49;177H7[14;27H[?25h[?25l[49;163H6[14;28H[48;5;242mn[m[46m([min[46m)[m[49;177H8[14;28H[?25h[?25l[49;163H7[14;29H[48;5;242m([min)[49;177H9[14;29H[?25h[?25l[49;163H8[14;30H[48;5;242mi[m[49;176H30[14;30H[?25h[?25l[?25h[?25l[49;163H [15;32H[49;4H[1mINSERTt --[m[49;13H[K[49;173H15,32[9CAll[14;23Htrlen(i[15;31H[46m{[23;3H}[15;32H[?25h[?25l[14;28H([min[46m)[m[15;31H{[23;3H}[49;174H4[14;32H[?25h[?25l(in)[49;176H25[14;25H[?25h[?25l[49;176H37[14;37H[?25h[?25l[19;10H[46m{[21;5H}[m[49;174H9,11[19;11H[?25h[?25l[15;31H[46m{[m[19;10H{[21;5H}

  [46m}[m[49;174H5,32[15;32H[?25h[?25l[49;4H[1m(insert)- VISUAL --[m[49;173H[K[49;163H1[15;32H[49;173H15,32[9CAll[15;32H[?25h[?25l[49;163H2[14;71H[1C[96m[48;5;242mg, in order to see terminator '\[m[95m[48;5;242m0[m[96m[48;5;242m' we need '+[m[95m[48;5;242m1[m[96m[48;5;242m'[m[48;5;242m 
  [m[93m[48;5;242mfor[m[48;5;242m ([m[38;5;121m[48;5;242mint[m[48;5;242m i = [m[95m[48;5;242m0[m[48;5;242m; i < n; i++) { [m[23;3H}[49;174H4,71[14;71H[?25h[?25l[?25h[?25l[49;163H [14;119H[49;4H[1mINSERTt --[m[49;13H[K[49;173H14,119[8CAll[14;72H[96mg, in order to see terminator '\[m[95m0[m[96m' we need '+[m[95m1[m[96m'[m[14;119H[K[15;1H  [93mfor[m ([38;5;121mint[m i = [95m0[m; i < n; i++) {[15;32H[K[14;119H[?25h[?25l[49;177H06[14;106H[?25h[?25l[49;178H5[14;105H[?25h[?25l[49;178H4[14;104H[?25h[?25l[49;178H3[14;103H[?25h[?25l[49;178H2[14;102H[?25h[?25l[49;178H1[14;101H[?25h[?25l[49;178H0[14;100H[?25h[?25l[49;176H99 [14;99H[?25h[?25l[49;177H8[14;98H[?25h[?25l[49;177H7[14;97H[?25h[?25l[49;177H6[14;96H[?25h[?25l[49;177H5[14;95H[?25h[?25l[49;177H4[14;94H[?25h[?25l[49;177H3[14;93H[?25h[?25l[49;177H2[14;92H[?25h[?25l[49;177H1[14;91H[?25h[?25l[49;177H0[14;90H[?25h[?25l[1C[96m terminator '\[m[95m0[m[96m' we need '+[m[95m1[m[96m'[m[49;177H1[14;91H[?25h[?25l[96mt terminator '\[m[95m0[m[96m' we need '+[m[95m1[m[96m'[m[49;177H2[14;92H[?25h[?25l[96mh terminator '\[m[95m0[m[96m' we need '+[m[95m1[m[96m'[m[49;177H3[14;93H[?25h[?25l[96me terminator '\[m[95m0[m[96m' we need '+[m[95m1[m[96m'[m[49;177H4[14;94H[?25h[?25l[49;177H5[14;95H[?25h[?25l[49;177H6[14;96H[?25h[?25l[49;177H7[14;97H[?25h[?25l[49;177H8[14;98H[?25h[?25l[49;177H9[14;99H[?25h[?25l[49;176H100[14;100H[?25h[?25l[49;178H1[14;101H[?25h[?25l[49;178H2[14;102H[?25h[?25l[49;178H3[14;103H[?25h[?25l[49;178H4[14;104H[?25h[?25l[49;178H5[14;105H[?25h[?25l[49;178H6[14;106H[?25h[?25l[49;178H5[14;105H[?25h[?25l[49;178H6[14;106H[?25h[?25l[49;178H7[14;107H[?25h[?25l[49;178H8[14;108H[?25h[?25l[49;178H9[14;109H[?25h[?25l[49;177H10[14;110H[?25h[?25l[96m, we need '+[m[95m1[m[96m'[m[49;178H1[14;111H[?25h[?25l[96m, we need '+[m[95m1[m[96m'[m[49;178H2[14;112H[?25h[?25l[1C[96m we need '+[m[95m1[m[96m'[m[49;178H3[14;113H[?25h[?25l[96mwe need '+[m[95m1[m[96m'[m[14;125H[K[49;178H2[14;112H[?25h[?25l[96m we need '+[m[95m1[m[96m'[m[14;124H[K[49;178H1[14;111H[?25h[?25l[49;177H24[14;124H[?25h[?25l[96m [m[49;178H5[14;125H[?25h[?25l[96m.[m[49;178H6[14;126H[?25h[49;1H[K[14;125H[?25l[49;163H^[[14;125H[49;163H  [14;126H[49;173H14,125[8CAll[14;125H[?25h[?25l[49;163H:[14;125H[49;163H[K[49;1H:[?2004h[?25hx[?25l[?25h[?25l[?1006l[?1002l[?2004l"hello.cc" 48L, 1136C written]2;Terminal - ]1;Terminal - [23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[?2004l[?1l>[?25h[?1049l[23;0;0tbcohada1@g7-22:~/i240a/submit/lab2/2-hello$ [Kbcohada1@g7-22:~/i240a/submit/lab2/2-hello$ cd
bcohada1@g7-22:~$ cdvim hello.cc./hello lisa bart'lisa simpson' 'bart simpson'[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[Kvim hello.cc[3Pgdb hello./hello 'lisa simpson' 'bart simpson'[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Clisa bart[K[K[3Pmake[2Plscd 2*[3Plscd ~/i240a/submit/lab2
bcohada1@g7-22:~/i240a/submit/lab2$ ls
1-hello  2-hello  3-overload  lab2.LOG	Makefile
bcohada1@g7-22:~/i240a/submit/lab2$ cd 30-[K[K*
bcohada1@g7-22:~/i240a/submit/lab2/3-overload$ ls
Makefile  overload.cc
bcohada1@g7-22:~/i240a/submit/lab2/3-overload$ vim overload/[K.cc
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"overload.cc" 16L, 282C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[35m#include [m[31m<iostream>[m

[32mint[m f([32mint[m *a) { [38;5;130mreturn[m *a * [31m2[m; }
[32mint[m f([32mint[m a) { [38;5;130mreturn[m a + [31m1[m;}
[32mint[m f([32mint[m a, [32mint[m b) { [38;5;130mreturn[m a - b; }

[32mint[m
main() {
  [32mint[m a = [31m2[m;
  [32mint[m b = [31m3[m;
  std::cout
    << [31m"f(a) = "[m << f(a)
    << [31m"; f(&a) = "[m << f(&a)
    << [31m"; f(a, b) = "[m << f(a, b)
    << std::endl;
}
[94m~                                                                               [18;1H~                                                                               [19;1H~                                                                               [20;1H~                                                                               [21;1H~                                                                               [22;1H~                                                                               [23;1H~                                                                               [m[24;63H1,1[11CAll]2;overload.cc (~/projects/i240a/submit/lab2/3-overload) - VIM]1;overload.cc[1;1H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;81m#include [m[95m<iostream>[m

[38;5;121mint[m f([38;5;121mint[m *a) { [93mreturn[m *a * [95m2[m; }
[38;5;121mint[m f([38;5;121mint[m a) { [93mreturn[m a + [95m1[m;}
[38;5;121mint[m f([38;5;121mint[m a, [38;5;121mint[m b) { [93mreturn[m a - b; }

[38;5;121mint[m
main() {
  [38;5;121mint[m a = [95m2[m;
  [38;5;121mint[m b = [95m3[m;
  std::cout
    << [95m"f(a) = "[m << f(a)
    << [95m"; f(&a) = "[m << f(&a)
    << [95m"; f(a, b) = "[m << f(a, b)
    << std::endl;
}
[94m~                                                                               [18;1H~                                                                               [19;1H~                                                                               [20;1H~                                                                               [21;1H~                                                                               [22;1H~                                                                               [23;1H~                                                                               [m[24;63H1,1[11CAll"overload.cc" 16L, 282C[1;1H[?25h[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;81m#include [m[95m<iostream>[m

[38;5;121mint[m f([38;5;121mint[m *a) { [93mreturn[m *a * [95m2[m; }
[38;5;121mint[m f([38;5;121mint[m a) { [93mreturn[m a + [95m1[m;}
[38;5;121mint[m f([38;5;121mint[m a, [38;5;121mint[m b) { [93mreturn[m a - b; }

[38;5;121mint[m
main() {
  [38;5;121mint[m a = [95m2[m;
  [38;5;121mint[m b = [95m3[m;
  std::cout
    << [95m"f(a) = "[m << f(a)
    << [95m"; f(&a) = "[m << f(&a)
    << [95m"; f(a, b) = "[m << f(a, b)
    << std::endl;
}
[94m~                                                                                                                                                                                             [18;1H~                                                                                                                                                                                             [19;1H~                                                                                                                                                                                             [20;1H~                                                                                                                                                                                             [21;1H~                                                                                                                                                                                             [22;1H~                                                                                                                                                                                             [23;1H~                                                                                                                                                                                             [24;1H~                                                                                                                                                                                             [25;1H~                                                                                                                                                                                             [26;1H~                                                                                                                                                                                             [27;1H~                                                                                                                                                                                             [28;1H~                                                                                                                                                                                             [29;1H~                                                                                                                                                                                             [30;1H~                                                                                                                                                                                             [31;1H~                                                                                                                                                                                             [32;1H~                                                                                                                                                                                             [33;1H~                                                                                                                                                                                             [34;1H~                                                                                                                                                                                             [35;1H~                                                                                                                                                                                             [36;1H~                                                                                                                                                                                             [37;1H~                                                                                                                                                                                             [38;1H~                                                                                                                                                                                             [39;1H~                                                                                                                                                                                             [40;1H~                                                                                                                                                                                             [41;1H~                                                                                                                                                                                             [42;1H~                                                                                                                                                                                             [43;1H~                                                                                                                                                                                             [44;1H~                                                                                                                                                                                             [45;1H~                                                                                                                                                                                             [46;1H~                                                                                                                                                                                             [47;1H~                                                                                                                                                                                             [48;1H~                                                                                                                                                                                             [m[49;173H1,1[11CAll[1;1H[?25h[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;81m#include [m[95m<iostream>[m

[38;5;121mint[m f([38;5;121mint[m *a) { [93mreturn[m *a * [95m2[m; }
[38;5;121mint[m f([38;5;121mint[m a) { [93mreturn[m a + [95m1[m;}
[38;5;121mint[m f([38;5;121mint[m a, [38;5;121mint[m b) { [93mreturn[m a - b; }

[38;5;121mint[m
main() {
  [38;5;121mint[m a = [95m2[m;
  [38;5;121mint[m b = [95m3[m;
  std::cout
    << [95m"f(a) = "[m << f(a)
    << [95m"; f(&a) = "[m << f(&a)
    << [95m"; f(a, b) = "[m << f(a, b)
    << std::endl;
}
[94m~                                                                               [18;1H~                                                                               [19;1H~                                                                               [20;1H~                                                                               [21;1H~                                                                               [22;1H~                                                                               [23;1H~                                                                               [m[24;